#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityCategoryTilePanelBase_VM

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityCategoryTilePanelBase_VM.ActivityCategoryTilePanelBase_VM_C.EnableMouseWheelInput
// 0x0001 (0x0001 - 0x0000)
struct ActivityCategoryTilePanelBase_VM_C_EnableMouseWheelInput final
{
public:
	bool                                          bListenForInput;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ActivityCategoryTilePanelBase_VM.ActivityCategoryTilePanelBase_VM_C.ExecuteUbergraph_ActivityCategoryTilePanelBase_VM
// 0x0040 (0x0040 - 0x0000)
struct ActivityCategoryTilePanelBase_VM_C_ExecuteUbergraph_ActivityCategoryTilePanelBase_VM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bListenForInput;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive;                       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEntryWidth_NewWidth_ImplicitCast;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEntryHeight_NewHeight_ImplicitCast;    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ActivityCategoryTilePanelBase_VM.ActivityCategoryTilePanelBase_VM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityCategoryTilePanelBase_VM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ActivityCategoryTilePanelBase_VM.ActivityCategoryTilePanelBase_VM_C.Set Categories
// 0x0010 (0x0010 - 0x0000)
struct ActivityCategoryTilePanelBase_VM_C_Set_Categories final
{
public:
	TArray<class UFortActivityViewModel*>         In_Categories;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function ActivityCategoryTilePanelBase_VM.ActivityCategoryTilePanelBase_VM_C.Set Panel Display Name
// 0x0018 (0x0018 - 0x0000)
struct ActivityCategoryTilePanelBase_VM_C_Set_Panel_Display_Name final
{
public:
	class FText                                   In_Panel_Name;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function ActivityCategoryTilePanelBase_VM.ActivityCategoryTilePanelBase_VM_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct ActivityCategoryTilePanelBase_VM_C_SetActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

