#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityDetailsDisplayV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityDetailsDisplayV2.ActivityDetailsDisplayV2_C
// 0x0060 (0x0420 - 0x03C0)
class UActivityDetailsDisplayV2_C final : public UFortActivityDetailsDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DescriptionScrollRestarted;                        // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_ActivityBrowserSocialProof_C*      ActivityBrowserSocialProof;                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Mobile;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       CommonActivatableWidgetSwitcher_67;                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DisabledWarningHB;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DisabledWarningMessage;                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActivityBrowserStatusFavorite_C*       FavoriteStatus;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Accept;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USqueegeeInjectionSlot_C*               SqueegeeInjectionSlot;                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discovery_WarningIcon_C*           WBP_Discovery_WarningIcon;                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowAcceptButton;                                  // 0x0418(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowCreator;                                       // 0x0419(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowTags;                                          // 0x041A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowFavoriteStatus;                                // 0x041B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDetailsButton;                                 // 0x041C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ActivityDetailsDisplayV2_Button_Accept_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ActivityDetailsDisplayV2(int32 EntryPoint);
	class FText GetCreatorTextFormat(const class FText& CreatorName);
	void OnDescriptionScrollRestarted();
	void OnDetailsUpdated(const bool bIsDetailsValid, const bool bIsFavoritable);
	void OnFriendsPlayingChanged(int32 NumPlaying);
	void OnIsFavoriteChanged(const bool bIsFavorite, const bool bPlayAnimation);
	void OnLocalPlayerDemoted();
	void OnLocalPlayerPromotedToLeader();
	void OnParentActivated();
	void OnPartySizeChanged(const int32 PartySize);
	void OnPlayDisabled();
	void PreConstruct(bool IsDesignTime);
	void RefreshDisabledState();
	void ResetWidgetState();
	void SetButtonsInteractable(bool IsInteractionEnabled);
	void UpdateAcceptText(class UObject* ButtonWidget, bool IsDownloadRequired_0);
	void UpdateButtonVisibility(class UWidget* Target, bool ShowWidget);
	void UpdateCCU(int32 CCUCount);
	void UpdateDetailVisibility();
	void UpdateFavoriteStatus(bool IsFavorite);
	void UpdateVisibility(class UWidget* Target, bool ShowWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityDetailsDisplayV2_C">();
	}
	static class UActivityDetailsDisplayV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityDetailsDisplayV2_C>();
	}
};

}

