#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserCreatorPageView_NEW_VM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserCreatorPageView_NEW_VM.ActivityBrowserCreatorPageView_NEW_VM_C
// 0x0040 (0x0740 - 0x0700)
class UActivityBrowserCreatorPageView_NEW_VM_C final : public UFortActivityCreatorPageView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAndHideRowLoadingSpinner;                      // 0x0708(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RowLoadingSpinner;                                 // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_PageContent;                              // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discovery_NoResultsMessage_C*      WBP_Discovery_NoResultsMessage;                    // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discovery_NoResultsMessage_C*      WBP_Discovery_NoResultsMessage_67;                 // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       WidgetSwitcher_Results;                            // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        VerticalTilePadding;                               // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ActivityBrowserCreatorPageView_NEW_VM_TileView_PlayerActivities_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BP_OnTileViewUpdated();
	void Construct();
	void ExecuteUbergraph_ActivityBrowserCreatorPageView_NEW_VM(int32 EntryPoint);
	void OnCreatorActivitiesQueryFinished();
	void OnNoContentFoundForCreator();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserCreatorPageView_NEW_VM_C">();
	}
	static class UActivityBrowserCreatorPageView_NEW_VM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserCreatorPageView_NEW_VM_C>();
	}
};

}

