#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDBoundActionButton

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHUDBoundActionButton.AthenaHUDBoundActionButton_C
// 0x0040 (0x1520 - 0x14E0)
class UAthenaHUDBoundActionButton_C final : public UFortBoundActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ContentBorder;                                     // 0x14E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              InputActionIconScale;                              // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         MobileButtonStyle;                                 // 0x14F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         PCandConsoleButtonStyle;                           // 0x1500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USoundBase*                             OnPressedSound;                                    // 0x1508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnHoveredSound;                                    // 0x1510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnPressed();
	void Construct();
	void ExecuteUbergraph_AthenaHUDBoundActionButton(int32 EntryPoint);
	void UpdateInputActionIconSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHUDBoundActionButton_C">();
	}
	static class UAthenaHUDBoundActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDBoundActionButton_C>();
	}
};

}

