#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioWorldization

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AudioWorldization_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class AudioWorldization.AudioWorldizationReflectionProbe
// 0x0050 (0x02E0 - 0x0290)
class AAudioWorldizationReflectionProbe final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USubmixSendVolumeComponent*             SubmixSends;                                       // 0x0298(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioGameplayVolumeComponent*          AGVComponent;                                      // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x38];                                     // 0x02A8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioWorldizationReflectionProbe">();
	}
	static class AAudioWorldizationReflectionProbe* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAudioWorldizationReflectionProbe>();
	}
};

// Class AudioWorldization.AudioWorldizationDefaultSettings
// 0x0098 (0x00C8 - 0x0030)
class UAudioWorldizationDefaultSettings final : public UDeveloperSettings
{
public:
	struct FAudioWorldizationGlobalSettings       GlobalSettings;                                    // 0x0030(0x0030)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAudioWorldizationSettings             DefaultSettings;                                   // 0x0060(0x0058)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                ModulationParameters;                              // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioWorldizationDefaultSettings">();
	}
	static class UAudioWorldizationDefaultSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioWorldizationDefaultSettings>();
	}
};

// Class AudioWorldization.AudioWorldizationSubsystem
// 0x0128 (0x0168 - 0x0040)
class UAudioWorldizationSubsystem final : public UTickableWorldSubsystem
{
public:
	class USoundControlBus*                       EnclosureBus;                                      // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBus*                       WallDistanceBus;                                   // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBus*                       ListenerAzimuthBus;                                // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x30];                                      // 0x0058(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAudioWorldizationSettings             CurrentSettings;                                   // 0x0088(0x0058)(Transient, NativeAccessSpecifierPrivate)
	class AAudioWorldizationReflectionProbe*      VolumeActor;                                       // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioWorldizationTracePolicyBase*      TracePolicy;                                       // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioWorldizationTraceDirectionPolicyBase* TraceDirectionPolicy;                          // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x40];                                      // 0x00F8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAudioWorldizationSettings>     SettingsStack;                                     // 0x0138(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class USoundControlBus*>               QuadrantEnclosureBuses;                            // 0x0148(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class USoundControlBus*>               QuadrantWallDistanceBuses;                         // 0x0158(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void RemoveWorldizationSettings(const class FName InIdentifier);
	void SetDefaultSettings();
	void SetEnabled(bool bNewEnabled);
	void SetWorldizationSettings(const struct FAudioWorldizationSettings& InSettings);

	float GetAverageTraceDistance() const;
	float GetEnclosureFactor() const;
	const TArray<struct FAudioSphereTraceResult> GetTraceResults() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioWorldizationSubsystem">();
	}
	static class UAudioWorldizationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioWorldizationSubsystem>();
	}
};

// Class AudioWorldization.AudioWorldizationTraceDirectionPolicyBase
// 0x0000 (0x0028 - 0x0028)
class UAudioWorldizationTraceDirectionPolicyBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioWorldizationTraceDirectionPolicyBase">();
	}
	static class UAudioWorldizationTraceDirectionPolicyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioWorldizationTraceDirectionPolicyBase>();
	}
};

// Class AudioWorldization.AudioWorldizationTraceDirectionPolicyDefault
// 0x0000 (0x0028 - 0x0028)
class UAudioWorldizationTraceDirectionPolicyDefault : public UAudioWorldizationTraceDirectionPolicyBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioWorldizationTraceDirectionPolicyDefault">();
	}
	static class UAudioWorldizationTraceDirectionPolicyDefault* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioWorldizationTraceDirectionPolicyDefault>();
	}
};

// Class AudioWorldization.AudioWorldizationTracePolicyBase
// 0x0000 (0x0028 - 0x0028)
class UAudioWorldizationTracePolicyBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioWorldizationTracePolicyBase">();
	}
	static class UAudioWorldizationTracePolicyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioWorldizationTracePolicyBase>();
	}
};

// Class AudioWorldization.AudioWorldizationTracePolicyDefault
// 0x0000 (0x0028 - 0x0028)
class UAudioWorldizationTracePolicyDefault : public UAudioWorldizationTracePolicyBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioWorldizationTracePolicyDefault">();
	}
	static class UAudioWorldizationTracePolicyDefault* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioWorldizationTracePolicyDefault>();
	}
};

// Class AudioWorldization.GameFeatureAction_SetAudioWorldizationSettings
// 0x00A8 (0x00D0 - 0x0028)
class UGameFeatureAction_SetAudioWorldizationSettings final : public UGameFeatureAction
{
public:
	struct FAudioWorldizationSettings             Settings;                                          // 0x0028(0x0058)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x50];                                      // 0x0080(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_SetAudioWorldizationSettings">();
	}
	static class UGameFeatureAction_SetAudioWorldizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_SetAudioWorldizationSettings>();
	}
};

}

