#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkLoadouts

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutItemDefinition
// 0x0000 (0x0000 - 0x0000)
class ICosmeticLoadoutItemDefinition final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutItemDefinition">();
	}
	static class ICosmeticLoadoutItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticLoadoutItemDefinition>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutSchema
// 0x0010 (0x0040 - 0x0030)
class UCosmeticLoadoutSchema final : public UPrimaryDataAsset
{
public:
	TArray<class UCosmeticLoadoutSlotTemplate*>   Slots;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutSchema">();
	}
	static class UCosmeticLoadoutSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutSchema>();
	}
};

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate
// 0x0080 (0x00B0 - 0x0030)
class UCosmeticLoadoutSlotTemplate final : public UPrimaryDataAsset
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x0030(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  MetaTags;                                          // 0x0038(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FCosmeticLoadoutSlotRequirements       Requirements;                                      // 0x0058(0x0050)(Edit, NativeAccessSpecifierPrivate)
	struct FPrimaryAssetId                        DefaultCosmeticItemId;                             // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FPrimaryAssetId GetDefaultCosmeticItemId() const;
	const struct FGameplayTagContainer GetMetaTags() const;
	const struct FCosmeticLoadoutSlotRequirements GetRequirements() const;
	struct FGameplayTag GetSlotTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutSlotTemplate">();
	}
	static class UCosmeticLoadoutSlotTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutSlotTemplate>();
	}
};

}

