#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_CinematicSequence

#include "Basic.hpp"

#include "CRD_CinematicSequence_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class CRD_CinematicSequence.CinematicSequenceDeviceBase
// 0x0098 (0x0C50 - 0x0BB8)
class ACinematicSequenceDeviceBase final : public ABuildingProp
{
public:
	uint8                                         Pad_BB8[0x40];                                     // 0x0BB8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         Sequence;                                          // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0C00(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerController*                  InstigatingController;                             // 0x0C08(0x0008)(BlueprintVisible, Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         InstigatingTeam;                                   // 0x0C10(0x0001)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C11[0x3];                                      // 0x0C11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bLoopPlayback : 1;                                 // 0x0C14(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRestoreState : 1;                                 // 0x0C14(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAutoPlay : 1;                                     // 0x0C14(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_C15[0x3];                                      // 0x0C15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EFortMinigameState                            AutoPlayMinigameState;                             // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECinematicSequenceVisibility                  Visibility;                                        // 0x0C19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLevelSequenceActorAlwaysRelevant;                 // 0x0C1A(0x0001)(Edit, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1B[0x1];                                      // 0x0C1B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0C1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C20[0x30];                                     // 0x0C20(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GoToEndAndStop();
	void HandleSequencePlayerCreated(class ULevelSequencePlayer* Player);
	void Pause();
	void Play();
	void SetPlaybackFrame(int32 Frame);
	void SetPlaybackTime(float Time);
	void SetPlayRate(float PlayRate_0);
	void SetSequence(class ULevelSequence* Sequence_0);
	void Stop();

	int32 GetPlaybackFrame() const;
	float GetPlaybackTime() const;
	float GetPlayRate() const;
	class UMovieSceneSequencePlayer* GetSequencePlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CinematicSequenceDeviceBase">();
	}
	static class ACinematicSequenceDeviceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACinematicSequenceDeviceBase>();
	}
};

}

