#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeEmporiumUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "CreativeEmporiumUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CreativeEmporiumUI.EmporiumBrowserFilterEntry
// 0x0060 (0x14F0 - 0x1490)
class UEmporiumBrowserFilterEntry final : public UCommonButtonBase
{
public:
	TMulticastInlineDelegate<void(bool bIsEnabled, class UObject* ListItemObject)> OnFilterEnabled;  // 0x1490(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsSelected, class UEmporiumBrowserFilterEntry* Entry)> OnFilterSelected; // 0x14A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* ListItemObject)> OnWidgetDestroyed;                 // 0x14B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCommonTextBlock*                       TextBlock_FilterName;                              // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFilterActive;                                     // 0x14C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14C9[0x7];                                     // 0x14C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmporiumBrowserTag*                    tag;                                               // 0x14D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonText;                                        // 0x14D8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void SetIsFilterActive(bool bInFilterActive);
	void UpdateButtonText();
	void UpdateCheckMarkState(bool bIsChecked);
	void UpdateItemCount(int32 ItemCount);

	bool IsFilterActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumBrowserFilterEntry">();
	}
	static class UEmporiumBrowserFilterEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumBrowserFilterEntry>();
	}
};

// Class CreativeEmporiumUI.EmporiumBrowserTag
// 0x0008 (0x0030 - 0x0028)
class UEmporiumBrowserTag final : public UObject
{
public:
	class FName                                   TagID;                                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumBrowserTag">();
	}
	static class UEmporiumBrowserTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumBrowserTag>();
	}
};

// Class CreativeEmporiumUI.EmporiumBrowserFiltersPanel
// 0x01D8 (0x04C0 - 0x02E8)
class UEmporiumBrowserFiltersPanel final : public UCommonUserWidget
{
public:
	TMulticastInlineDelegate<void()>              OnFilterChanged;                                   // 0x02E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSortChanged;                                     // 0x02F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSubFilterToggled;                                // 0x0308(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsFocused)> OnFocusChanged;                                  // 0x0318(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName CategoryID)> OnCategoryActivated;                      // 0x0328(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortEmporiumFilterCategoryHeader> FilterSectionHeaderWidgetClass;             // 0x0338(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortEmporiumFilterCategoryHeader> FilterCategoryHeaderWidgetClass;            // 0x0340(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortEmporiumFilterCategoryHeader> FilterHomeHeaderWidgetClass;                // 0x0348(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UEmporiumBrowserFilterEntry> FilterEntryWidgetClass;                           // 0x0350(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmporiumSortEntry>         SortEntries;                                       // 0x0358(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortEmporiumFilterEntry>       FilterEntries;                                     // 0x0368(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortEmporiumPriceFilterEntry>  PriceFilterEntries;                                // 0x0378(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           LicenseFilterEntries;                              // 0x0388(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   DefaultCategoryFilter;                             // 0x0398(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ShowAllButtonID;                                   // 0x039C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A0[0x50];                                     // 0x03A0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_FilterScroll;                            // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmporiumBrowserFilterEntry*            Button_All;                                        // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USearchPanel*                           SearchPanel;                                       // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SortAndFilter;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_410[0xB0];                                     // 0x0410(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExcludeItemDetailTag(const class FName& TagID);
	void HandleCategoryActivated(bool bIsExpanded, class UObject* ListItemObject);
	void HandleCategoryWidgetDestroyed(class UObject* ListItemObject);
	void HandleFilterEnabled(bool bIsFilterEnabled, class UObject* ListItemObject);
	void HandleFilterSelected(bool bIsFilterEnabled, class UEmporiumBrowserFilterEntry* Entry);
	void HandleSearchTextChanged(const class FText& Text);
	void HandleShowAllEnabled(bool bShowAllItems, class UObject* ListItemObject);
	void HandleSortAndFilterClicked();
	void IncludeItemDetailTag(const class FName& TagID);
	void SetItemDetailTags(const TArray<class FName>& TagIDs);

	int32 GetFilterCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumBrowserFiltersPanel">();
	}
	static class UEmporiumBrowserFiltersPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumBrowserFiltersPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumFilterCategoryHeader
// 0x0028 (0x02E8 - 0x02C0)
class UFortEmporiumFilterCategoryHeader final : public UUserWidget
{
public:
	TMulticastInlineDelegate<void(bool bIsExpanded, class UObject* ListItemObject)> OnCategoryActivated; // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* ListItemObject)> OnWidgetDestroyed;                 // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UEmporiumBrowserTag*                    tag;                                               // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ActivateCategory(bool bExpanded);
	void AddSubcategoryWidget(class UWidget* SubcategoryWidget);
	void ClearSubcategoryWidgets();
	void ExpandCategory(bool bExpanded);
	void SetCategoryText(const class FText& NewButtonText);
	void SetSubcategoryCount(int32 NewCount);
	void UpdateCategoryCount(int32 NewCount, bool bHideIfEmpty);

	TArray<class UWidget*> GetSubcategoryWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumFilterCategoryHeader">();
	}
	static class UFortEmporiumFilterCategoryHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumFilterCategoryHeader>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumFiltersSubPanel
// 0x0000 (0x02C0 - 0x02C0)
class UFortEmporiumFiltersSubPanel final : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumFiltersSubPanel">();
	}
	static class UFortEmporiumFiltersSubPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumFiltersSubPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeEntryObjectWrapper
// 0x0008 (0x0030 - 0x0028)
class UFortEmporiumHomeEntryObjectWrapper final : public UObject
{
public:
	class UFortEmporiumItemListTabPanel*          TabPanel;                                          // 0x0028(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeEntryObjectWrapper">();
	}
	static class UFortEmporiumHomeEntryObjectWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeEntryObjectWrapper>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeListEntry
// 0x01F8 (0x04B8 - 0x02C0)
class UFortEmporiumHomeListEntry final : public UUserWidget
{
public:
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumHomeListView*              ParentView;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D0[0x30];                                     // 0x02D0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxItemsToShow;                                    // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumItemListTabPanel*          TabPanel;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_CategoryLabel;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCreativeItemTileView*            HomeListView_ItemOptions;                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x198];                                    // 0x0320(0x0198)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateWarningMessage(bool bShowMessage);

	EFortItemCardSize GetCardSizeForCategory() const;
	bool GetCollapseBorderPadFlagForCategory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeListEntry">();
	}
	static class UFortEmporiumHomeListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeListEntry>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeListView
// 0x0240 (0x0E10 - 0x0BD0)
class UFortEmporiumHomeListView final : public UCommonListView
{
public:
	uint8                                         Pad_BD0[0x88];                                     // 0x0BD0(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortEmporiumItemListTabPanel*>  TabPanelList;                                      // 0x0C58(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C68[0x1A8];                                    // 0x0C68(0x01A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* GetFocusWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeListView">();
	}
	static class UFortEmporiumHomeListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeListView>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeTabPanel
// 0x0040 (0x0488 - 0x0448)
class UFortEmporiumHomeTabPanel final : public UFortCreativeContentBrowserTabPanelBase
{
public:
	uint8                                         Pad_448[0x30];                                     // 0x0448(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FeaturedItemTag;                                   // 0x0478(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumHomeListView*              FortEmporiumHomeListView_Options;                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeTabPanel">();
	}
	static class UFortEmporiumHomeTabPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeTabPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItem
// 0x0008 (0x0090 - 0x0088)
class UFortEmporiumItem final : public UFortItem
{
public:
	class UFortEmporiumItemDefinition*            ItemDefinition;                                    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItem">();
	}
	static class UFortEmporiumItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItem>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemDefinition
// 0x0110 (0x0488 - 0x0378)
class UFortEmporiumItemDefinition final : public UFortItemDefinition
{
public:
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UFortEmporiumItemDefinition* ItemDefinition)> OnItemThumbnailDownloaded; // 0x0380(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_390[0xE8];                                     // 0x0390(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ThumbnailTexture;                                  // 0x0478(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_480[0x8];                                      // 0x0480(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const struct FFortEmporiumItemData GetEmporiumItemData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemDefinition">();
	}
	static class UFortEmporiumItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemDefinition>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemDetailsPanel
// 0x0068 (0x0350 - 0x02E8)
class UFortEmporiumItemDetailsPanel final : public UCommonUserWidget
{
public:
	uint8                                         Pad_2E8[0x30];                                     // 0x02E8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ItemDetailTagsInputRowHandle;                      // 0x0318(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CachedItemDefinition;                              // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_Details;                                  // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortEmporiumItemInfo*                  ItemDetails;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDetailsHostPanel*              LegacyItemDetails;                                 // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleItemTagSelected(class FName TagID, bool bSelected);
	void HideAdditionalButtons();
	void HideExtendedDataPanel();
	bool IsShowingAdditionalButtons();
	void SetActiveItemDetailTags(const TArray<class FName>& ActiveTags);
	void SetItemDetails(const class UFortItem* FortItem, const bool bUseLargeThumbnail, const bool bAllowInteractiveTags);
	void SetItemToDetail(const class UFortItem* InItemToDetail, const bool bUseLargeThumbnail, const bool bAllowInteractiveTags);
	void SetSpecialItemTagVisibility(const class FName& SpecialItemTag);
	void ShowExtendedDataPanel();
	void ToggleItemDetailsPanel();
	void UpdateItemDetailsDisplay(bool bShowItemDetails);

	TArray<class FName> BP_GetSpecialItemTags() const;
	bool HasLegacyItemDetailsPanel() const;
	bool IsShowingExtendedDataPanel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemDetailsPanel">();
	}
	static class UFortEmporiumItemDetailsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemDetailsPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemInfo
// 0x0010 (0x02F8 - 0x02E8)
class UFortEmporiumItemInfo final : public UCommonUserWidget
{
public:
	TArray<class FName>                           HiddenTags;                                        // 0x02E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void SetSelectItemTagsIcon(const struct FSlateBrush& SelectItemTagsIcon);
	void SetSelectItemTagsPrompt(const class FText& Prompt);
	void SetTagFocus();
	void ShowSelectItemTagsPrompt(bool bShowPrompt);
	void UpdateWithFortItem(const class UFortItem* Item, const bool bAllowInteractiveTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemInfo">();
	}
	static class UFortEmporiumItemInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemInfo>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumCategoryEntry
// 0x0020 (0x0048 - 0x0028)
class UFortEmporiumCategoryEntry final : public UObject
{
public:
	class FString                                 Path;                                              // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumCategoryEntry">();
	}
	static class UFortEmporiumCategoryEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumCategoryEntry>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemListMenu
// 0x0430 (0x0830 - 0x0400)
class UFortEmporiumItemListMenu final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x30];                                     // 0x0400(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCreativeItemListPanelData> PanelDataClass;                                // 0x0430(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             ItemListCategorySource;                            // 0x0438(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCreativeItemListPanelData*         ItemListPanelData;                                 // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortEmporiumItemListTabPanel> InventoryTabClass;                              // 0x0448(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortCreativeLevelManagementTabPanel> LevelManagementTabClass;                 // 0x0450(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortEmporiumHomeTabPanel>  HomeTabClass;                                      // 0x0458(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButtonBase>          InventoryTabButton;                                // 0x0460(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortEmporiumItemListTabPanel*          ChestTabPanel;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeLevelManagementTabPanel*   LevelManagementTabPanel;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumHomeTabPanel*              HomeTabPanel;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemListTabPanel*          FabTabPanel;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemListTabPanel*          SubItemsTabPanel;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FabTabNameId;                                      // 0x0490(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_494[0xC];                                      // 0x0494(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x04A0(0x00F0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAthenaMapScreenContainerTabInfo       MapScreenContainerTabInfo;                         // 0x0590(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bIsDefaultActiveTab;                               // 0x05D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAddItemToInventoryOnEquip;                        // 0x05D9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLoadItemsOnInitialized;                           // 0x05DA(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5DB[0x1];                                      // 0x05DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastUsedSlot;                                      // 0x05DC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5E0[0x8];                                      // 0x05E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UFortCreativeContentBrowserTabPanelBase*> TabMap;                        // 0x05E8(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_638[0xD0];                                     // 0x0638(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortEmporiumItemDefinition*>    EmporiumItemDefinitionList;                        // 0x0708(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_718[0x8];                                      // 0x0718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonAnimatedSwitcher*                Switcher_Categories;                               // 0x0720(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_ItemTabWarnings;                          // 0x0728(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ChestEmpty;                                // 0x0730(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_TabEmpty;                                  // 0x0738(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_DownloadingFabCategories;                  // 0x0740(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_FabCategoriesNotLoaded;                    // 0x0748(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_CommandBar;                               // 0x0750(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ChestCommands;                             // 0x0758(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_VendCommands;                              // 0x0760(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeMenuQuickbar*              MenuQuickbar_QuickBars;                            // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ResetChest;                                 // 0x0770(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CreateChest;                                // 0x0778(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_AddToQuickBar;                              // 0x0780(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_OpenItem;                                   // 0x0788(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PlaceNow;                                   // 0x0790(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Equip;                                      // 0x0798(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_AddToChest;                                 // 0x07A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Drop;                                       // 0x07A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CreateLlama;                                // 0x07B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_RemoveFromChest;                            // 0x07B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_SearchFilters;                             // 0x07C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*                Switcher_LeftPanel;                                // 0x07C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmporiumBrowserFiltersPanel*           FiltersPanel;                                      // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemDetailsPanel*          SubTabItemDetailsPanel;                            // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter;                         // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_SidePanels;                               // 0x07E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemDetailsPanel*          ItemDetailsSidePanel_DefaultSidePanel;             // 0x07F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_ProductPage;                              // 0x07F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ItemBrowser;                               // 0x0800(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemDetailsPanel*          ItemProductPagePanel;                              // 0x0808(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_InventoryPermission;                      // 0x0810(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_EmporiumPanel;                             // 0x0818(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_InventoryNotAllowed;                       // 0x0820(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_EditorDisconnected;                        // 0x0828(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool AddSelectionToQuickBar();
	bool DropItem(const struct FFortItemEntry& SelectedItem);
	bool EquipItem(const struct FFortItemEntry& ItemEntry);
	bool EquipSelection();
	void HandleAddSelectionToMoveToolComplete();
	void HandleCategoryActivated(class FName CategoryID);
	void HandleChestItemCountChanged(int32 Count);
	void HandleEquipItem(const struct FFortItemEntry& ItemEntry);
	void HandleFilterButtonClicked(class FName FilterNameId, class UCommonButtonBase* NewButton);
	void HandleFilterChanged();
	void HandleFilterPanelIsFocused(bool bIsFocused);
	void HandleGlobalSortPanelToggle();
	void HandleItemClicked(const struct FFortItemEntry& ItemEntry);
	void HandleItemDoubleClicked(const struct FFortItemEntry& ItemEntry);
	void HandleItemTagSelected(const class FName& TagID, bool bSelected);
	void HandleItemThumbnailDownloaded(class UFortEmporiumItemDefinition* ItemDefinition);
	void HandleModalHitBlockerClicked();
	void HandleQuickbarPanelIsFocused(bool bIsFocused);
	void HandleQuickbarStateChanged(const EFortContentBrowserQuickbarState State);
	void HandleSelectionChanged(class UFortCreativeContentBrowserTabPanelBase* Tab);
	void HandleSortButtonClicked(class FName SortNameId, class UCommonButtonBase* NewButton);
	void HandleSortChanged();
	void HandleTabItemDetailClicked(const class FName& TagID);
	void HandleTabSelected(class FName TabID);
	void HandleTabSortButtonClicked();
	void InitializeFabTab();
	void InitializeTabs();
	void LoadFabItems();
	void NativeOnBuiltInItemsLoaded();
	void NativeOnItemsLoaded();
	void NativeOnItemsRefreshed();
	void OnBuiltInItemsLoaded();
	void OnContentRatingFilterChanged();
	void OnCreativeQuickbarComponentLoaded();
	void OnCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void OnExitSubTab();
	void OnFabCategoryListLoaded(bool bSuccess, const class FString& JsonString);
	void OnFabItemQueryComplete(bool bSuccess, const class FString& JsonString);
	void OnItemEquipped(const struct FFortItemEntry& EquippedItemEntry);
	void OnItemsLoaded();
	void OnQuickbarStateChanged(const EFortContentBrowserQuickbarState State);
	void OnSearchFiltersVisibilityChanged(bool bIsVisible);
	void OnSelectionOpened(const class UFortItemDefinition* SelectedItemDefinition);
	void OnShowCategoryModal(bool bShowModal);
	bool OpenSelection();
	bool PlaceSelectionInMoveTool();
	void RefreshTabWarningState();
	void SetIsItemCommandsEnabled(bool bInIsItemCommandEnabled);
	void SetSubTabOpened(class UFortItemDefinition* ItemDefinition);
	void SpawnContainer(TSubclassOf<class AActor> SupplyDropClass);
	void SwitchItemDetailsPanel(bool bUseLegacy);
	void UpdateDetailsPanel();
	void UpdatePermissionsDisplay();

	bool CanAddToChest(const struct FFortItemEntry& SelectedItem) const;
	bool CanDropItem(const struct FFortItemEntry& SelectedItem) const;
	bool CanEquip(const struct FFortItemEntry& SelectedItem) const;
	struct FFortItemEntry GetCurrentSelection() const;
	class UFortCreativeContentBrowserTabPanelBase* GetCurrentTab() const;
	class FName GetLastSelectedTabName() const;
	class UFortItemDefinition* GetSubTabSelectedItemDefinition() const;
	bool IsSubTabOpened() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemListMenu">();
	}
	static class UFortEmporiumItemListMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemListMenu>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemListTabPanel
// 0x03F8 (0x0840 - 0x0448)
class UFortEmporiumItemListTabPanel final : public UFortCreativeContentBrowserTabPanelBase
{
public:
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 Count)>   OnSourceItemCountChanged;                          // 0x0450(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FFortItemEntry& ItemClicked)> OnItemClickedDelegate;  // 0x0460(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FFortItemEntry& ItemClicked)> OnItemDoubleClickedDelegate; // 0x0470(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_480[0x30];                                     // 0x0480(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCreativeItemTileView*            CreativeTileView_ItemOptions;                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Sort;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortItemEntry                         CurrentItemEntry;                                  // 0x04C0(0x0198)(BlueprintVisible, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(int32 Count)>   OnItemCountChanged;                                // 0x0658(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TArray<struct FFortItemEntry>                 Items;                                             // 0x0668(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FFortItemEntry>                 SourceItems;                                       // 0x0678(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_688[0x1A0];                                    // 0x0688(0x01A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumItemListMenu*              EmporiumItemListMenuParent;                        // 0x0828(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_830[0x10];                                     // 0x0830(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddItem(struct FFortItemEntry& ItemToAdd);
	void AddItemToSource(struct FFortItemEntry& ItemToAdd);
	void ClearAllItems();
	void ClearFilteredItems();
	void FocusCurrentSelection();
	void HandleItemDetailTagSelected(const class FName& TagID);
	bool IsEmpty();
	void ItemEquipped(const struct FFortItemEntry& Item);
	void RemoveSelectedItem();
	void RestoreLastSelection();
	void SetActiveItemDetailTags(const TArray<class FName>& TagIDs);
	void ShowTopButtonBar(bool bShow);
	void UpdateSortButton(const class FText& SortType);
	void UpdateTabHeader();

	bool CanPlayerCreateInVolume() const;
	EFortItemCardSize GetCardSizeForCategory() const;
	bool GetCollapseBorderPadFlagForCategory() const;
	class UFortItemDefinition* GetSubTabSelectedItemDefinition() const;
	bool IsSubTabOpened() const;
	bool ShowLegacyItemDetailsPanel() const;

public:
	static class UClass* StaticClass()
	{
