#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoverLibraryView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DiscoverLibraryView.DiscoverLibraryView_C
// 0x0098 (0x0498 - 0x0400)
class UDiscoverLibraryView_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortDiscoverSurfaceViewModel*          FortDiscoverSurfaceViewModel;                      // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_BackToTopHackForBottomBar;                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderText;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HeaderSoftEdge;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadingResults_Spinner;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RowLoadingSpinner;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_HasResultsEnum;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TileContainerOverlay;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortActivityTileView*                  TileView_LibraryResults;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discovery_BlankTiles_RoundedCorners_C* WBP_Discovery_BlankTiles_RoundedCorners;       // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingMorePages_C*                WBP_LoadingMorePages;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_C*                      WBP_UIKit_Tabs_LIBRARY;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    No_Input_Action_Row;                               // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    Back_To_Top_Input_Action_Row;                      // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class USoundBase*                             IntroWhooshSound;                                  // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousSelectedTileIndex;                         // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_DiscoverLibraryView(int32 EntryPoint);
	void FillOutTileViewData();
	void OnItemInitialized(class UObject* Item, class UUserWidget* Widget);
	void OnQueryingMorePages(bool IsQueryingNewPages);
	void OnTabSelectedSwitchContent(class FName TabID);
	void OnTileViewScrolled(float ItemOffset, float DistanceRemaining);
	void OnUpdateProviders(TArray<class UFortDiscoverProviderViewModel*>& ProvidersVM);
	void PreConstruct(bool IsDesignTime);
	void SetFavoritesHeaderText();
	void SetFavoritesNoResultsText();
	void SetNoResultsAndHeaderText(int32 SelectedTabIndex);
	void SetRecentlyPlayedHeaderText();
	void SetRecentlyPlayedNoResultsText();
	void TopLevelTabChanged(const EFortUIFeature LeavingFeature, const EFortUIFeature EnteringFeature);

	class UWidget* BP_GetDesiredFocusTarget() const;
	void OnUpdateNew(TArray<class UFortDiscoverProviderViewModel*>& ProviderOuterArrayVM, int32 OuterIndex, TArray<class UFortActivityViewModel*>* InnerArray) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DiscoverLibraryView_C">();
	}
	static class UDiscoverLibraryView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoverLibraryView_C>();
	}
};

}

