#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DistortedWeaponsUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function DistortedWeaponsUI.ChromeWeaponInfoWidget.HandleUpgradeTriggered
// 0x0008 (0x0008 - 0x0000)
struct ChromeWeaponInfoWidget_HandleUpgradeTriggered final
{
public:
	float                                         ReloadTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortWeaponReloadType                         ReloadType;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DistortedWeaponsUI.ChromeWeaponInfoWidget.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct ChromeWeaponInfoWidget_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DistortedWeaponsUI.ChromeWeaponInfoWidget.HandleXpChanged
// 0x0008 (0x0008 - 0x0000)
struct ChromeWeaponInfoWidget_HandleXpChanged final
{
public:
	float                                         XPDelta;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentXPPercentage;                               // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DistortedWeaponsUI.ChromeWeaponInfoWidget.OnGainedXp
// 0x0004 (0x0004 - 0x0000)
struct ChromeWeaponInfoWidget_OnGainedXp final
{
public:
	float                                         CurrentXPPercentage;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DistortedWeaponsUI.ChromeWeaponInfoWidget.OnReadyToUpgradeWeapon
// 0x0001 (0x0001 - 0x0000)
struct ChromeWeaponInfoWidget_OnReadyToUpgradeWeapon final
{
public:
	EFortRarity                                   NextRarity;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DistortedWeaponsUI.ChromeWeaponInfoWidget.GetCurrentWeaponRarity
// 0x0001 (0x0001 - 0x0000)
struct ChromeWeaponInfoWidget_GetCurrentWeaponRarity final
{
public:
	EFortRarity                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

