#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmeraldGlass_DRuntime

#include "Basic.hpp"

#include "EmeraldGlass_DRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class EmeraldGlass_DRuntime.SereneYardAnimInstanceProxy
// 0x0030 (0x1610 - 0x15E0)
class USereneYardAnimInstanceProxy final : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsUpperBody;                                      // 0x15D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGrindRail;                                        // 0x15D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireToSprint;                                // 0x15DA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireToIdle;                                  // 0x15DB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireFallStart;                               // 0x15DC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireFallEnd;                                 // 0x15DD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireFullBodyGround;                          // 0x15DE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFire;                                        // 0x15DF(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireUpperBody;                               // 0x15E0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromIceFireEndStates;                           // 0x15E1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTrFromFireEndIdle;                              // 0x15E2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTrFromFireEndLoco;                              // 0x15E3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFireExitUnexpectedly;                           // 0x15E4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFireEndExitUnexpectedly;                        // 0x15E5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15E6[0x2];                                     // 0x15E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               UpperBodyTwistRotator;                             // 0x15E8(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TurnEndThreshold;                                  // 0x1600(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnEndLocoThreshold;                              // 0x1604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnVelocityZThreshold;                            // 0x1608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterruptibleThreshold;                            // 0x160C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SereneYardAnimInstanceProxy">();
	}
	static class USereneYardAnimInstanceProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USereneYardAnimInstanceProxy>();
	}
};

// Class EmeraldGlass_DRuntime.EmeraldGlassIceWallChunk
// 0x0018 (0x0BD0 - 0x0BB8)
class AEmeraldGlassIceWallChunk final : public ABuildingProp
{
public:
	TWeakObjectPtr<class AEmeraldGlassIceWallChunk> ParentChunk;                                     // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           IceWallActorClassDenyList;                         // 0x0BC0(0x0010)(ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void AttachActors(const TArray<class AEmeraldGlassIceWallChunk*>& ChunksInMyWall, const TArray<class AActor*>& SupportingActors, class AActor* DirectBase);
	void FindSupportingActors(TArray<class AActor*>& InOutSupportingActors, const bool bAllowIceWallsAsSupportingActors, const TArray<class AEmeraldGlassIceWallChunk*>& ChunksInMyWall);

	bool IsIceWallAllowedToOverlapActor(const class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmeraldGlassIceWallChunk">();
	}
	static class AEmeraldGlassIceWallChunk* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEmeraldGlassIceWallChunk>();
	}
};

// Class EmeraldGlass_DRuntime.FortControllerComponent_SereneYard
// 0x0010 (0x00B0 - 0x00A0)
class UFortControllerComponent_SereneYard final : public UControllerComponent
{
public:
	TArray<TWeakObjectPtr<class ABuildingGameplayActor>> TrackedInstances;                           // 0x00A0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void AddTrackedInstance(class ABuildingGameplayActor* TrackedInstance);
	void RemoveOldestTrackedInstance();

	class ABuildingGameplayActor* GetOldestTrackedInstance() const;
	int32 GetTrackedInstanceCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_SereneYard">();
	}
	static class UFortControllerComponent_SereneYard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_SereneYard>();
	}
};

// Class EmeraldGlass_DRuntime.SereneYardFunctionLibraryNative
// 0x0000 (0x0028 - 0x0028)
class USereneYardFunctionLibraryNative final : public UBlueprintFunctionLibrary
{
public:
	static void GetIceChunkRelativeTransforms(const TSubclassOf<class ABuildingGameplayActor> IceClass, TArray<struct FTransform>& OutRelativeTransforms);
	static bool NativeCheckSpawnValidity(const struct FSereneYardWeaponData& WeaponData, struct FVector& InOutTargetLocation, const float CameraYaw, const bool bCheckForAllChunks, TArray<bool>* OutValidity, TArray<double>* OutOffsets, TArray<class AActor*>* OutActorsBeingUsedAsBase, ESereneYardTargetingFailedReason* OutFailureReason);
	static bool NativeFindBestValidHit(const struct FSereneYardWeaponData& WeaponData, const TArray<struct FHitResult>& HitResults, struct FHitResult* OutBestValidHit, bool* bOutTreatAsInvalidForVerticalTest, bool bFindHitClosestToCenterZ, float CenterZ, bool bCheckTooCloseForHeight, bool bCheckNotWalkable);
	static bool NativeTraceForSpawning(const struct FSereneYardWeaponData& WeaponData, const struct FVector& StartLocation, const struct FVector& EndLocation, struct FHitResult* OutHitResult, struct FVector* outTargetLocation, bool* bOutTreatAsInvalidForVerticalTest, bool* bOutNoHitsFound, bool bFindHitClosestToCenterZ, bool bUseSphereTrace, bool bCheckTooCloseForHeight, bool bCheckNotWalkable);
	static bool NativeUpdateTarget(const struct FSereneYardWeaponData& WeaponData, struct FVector* outTargetLocation, ESereneYardTargetingFailedReason* OutFailureReason, TArray<bool>* OutValidity);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SereneYardFunctionLibraryNative">();
	}
	static class USereneYardFunctionLibraryNative* GetDefaultObj()
	{
		return GetDefaultObjImpl<USereneYardFunctionLibraryNative>();
	}
};

}

