#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmeraldGlass_DRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EmeraldGlass_DRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EmeraldGlass_DRuntime.EmeraldGlassIceWallChunk.AttachActors
// 0x0028 (0x0028 - 0x0000)
struct EmeraldGlassIceWallChunk_AttachActors final
{
public:
	TArray<class AEmeraldGlassIceWallChunk*>      ChunksInMyWall;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         SupportingActors;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 DirectBase;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EmeraldGlass_DRuntime.EmeraldGlassIceWallChunk.FindSupportingActors
// 0x0028 (0x0028 - 0x0000)
struct EmeraldGlassIceWallChunk_FindSupportingActors final
{
public:
	TArray<class AActor*>                         InOutSupportingActors;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bAllowIceWallsAsSupportingActors;                  // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEmeraldGlassIceWallChunk*>      ChunksInMyWall;                                    // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function EmeraldGlass_DRuntime.EmeraldGlassIceWallChunk.IsIceWallAllowedToOverlapActor
// 0x0010 (0x0010 - 0x0000)
struct EmeraldGlassIceWallChunk_IsIceWallAllowedToOverlapActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EmeraldGlass_DRuntime.FortControllerComponent_SereneYard.AddTrackedInstance
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_SereneYard_AddTrackedInstance final
{
public:
	class ABuildingGameplayActor*                 TrackedInstance;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EmeraldGlass_DRuntime.FortControllerComponent_SereneYard.GetOldestTrackedInstance
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_SereneYard_GetOldestTrackedInstance final
{
public:
	class ABuildingGameplayActor*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EmeraldGlass_DRuntime.FortControllerComponent_SereneYard.GetTrackedInstanceCount
// 0x0004 (0x0004 - 0x0000)
struct FortControllerComponent_SereneYard_GetTrackedInstanceCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EmeraldGlass_DRuntime.SereneYardFunctionLibraryNative.GetIceChunkRelativeTransforms
// 0x0018 (0x0018 - 0x0000)
struct SereneYardFunctionLibraryNative_GetIceChunkRelativeTransforms final
{
public:
	TSubclassOf<class ABuildingGameplayActor>     IceClass;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     OutRelativeTransforms;                             // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function EmeraldGlass_DRuntime.SereneYardFunctionLibraryNative.NativeCheckSpawnValidity
// 0x0138 (0x0138 - 0x0000)
struct SereneYardFunctionLibraryNative_NativeCheckSpawnValidity final
{
public:
	struct FSereneYardWeaponData                  WeaponData;                                        // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                InOutTargetLocation;                               // 0x00E0(0x0018)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraYaw;                                         // 0x00F8(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckForAllChunks;                                // 0x00FC(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  OutValidity;                                       // 0x0100(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<double>                                OutOffsets;                                        // 0x0110(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         OutActorsBeingUsedAsBase;                          // 0x0120(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	ESereneYardTargetingFailedReason              OutFailureReason;                                  // 0x0130(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0131(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EmeraldGlass_DRuntime.SereneYardFunctionLibraryNative.NativeFindBestValidHit
// 0x01E0 (0x01E0 - 0x0000)
struct SereneYardFunctionLibraryNative_NativeFindBestValidHit final
{
public:
	struct FSereneYardWeaponData                  WeaponData;                                        // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FHitResult>                     HitResults;                                        // 0x00E0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FHitResult                             OutBestValidHit;                                   // 0x00F0(0x00E0)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bOutTreatAsInvalidForVerticalTest;                 // 0x01D0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFindHitClosestToCenterZ;                          // 0x01D1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CenterZ;                                           // 0x01D4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckTooCloseForHeight;                           // 0x01D8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckNotWalkable;                                 // 0x01D9(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01DA(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1DB[0x5];                                      // 0x01DB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EmeraldGlass_DRuntime.SereneYardFunctionLibraryNative.NativeTraceForSpawning
// 0x0210 (0x0210 - 0x0000)
struct SereneYardFunctionLibraryNative_NativeTraceForSpawning final
{
public:
	struct FSereneYardWeaponData                  WeaponData;                                        // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                StartLocation;                                     // 0x00E0(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndLocation;                                       // 0x00F8(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             OutHitResult;                                      // 0x0110(0x00E0)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                outTargetLocation;                                 // 0x01F0(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutTreatAsInvalidForVerticalTest;                 // 0x0208(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutNoHitsFound;                                   // 0x0209(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFindHitClosestToCenterZ;                          // 0x020A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSphereTrace;                                   // 0x020B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckTooCloseForHeight;                           // 0x020C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckNotWalkable;                                 // 0x020D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x020E(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20F[0x1];                                      // 0x020F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EmeraldGlass_DRuntime.SereneYardFunctionLibraryNative.NativeUpdateTarget
// 0x0118 (0x0118 - 0x0000)
struct SereneYardFunctionLibraryNative_NativeUpdateTarget final
{
public:
	struct FSereneYardWeaponData                  WeaponData;                                        // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                outTargetLocation;                                 // 0x00E0(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESereneYardTargetingFailedReason              OutFailureReason;                                  // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  OutValidity;                                       // 0x0100(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0110(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

