#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EncountersRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "EncountersRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "StructUtils_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "GameplayStateTreeModule_classes.hpp"
#include "LagerRuntime_classes.hpp"


namespace SDK
{

// Class EncountersRuntime.EncounterMobAnchor
// 0x0020 (0x02B0 - 0x0290)
class AEncounterMobAnchor final : public AActor
{
public:
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0290(0x0020)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterMobAnchor">();
	}
	static class AEncounterMobAnchor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEncounterMobAnchor>();
	}
};

// Class EncountersRuntime.EncounterMobManagerComponent
// 0x0178 (0x0218 - 0x00A0)
class UEncounterMobManagerComponent final : public UGameFrameworkComponent
{
public:
	TArray<struct FEncounterMobInstance>          SpawnedMobs;                                       // 0x00A0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FEncounterMobSpawnData>         MobEncounterSpawnData;                             // 0x00B0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FEncounterMobSpawnInfo                 DefaultMobSpawnInfo;                               // 0x00C0(0x00A0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         LWMDensityWeight;                                  // 0x0160(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         LWMDensityRange;                                   // 0x0188(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier)> OnEncounterStarted;     // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier)> OnEncounterPaused;      // 0x01C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier)> OnEncounterResumed;     // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier, class AActor* SpawnedActor)> OnEncounterActorSpawned; // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier, class AActor* DamagedActor, class AActor* DamageCauser)> OnEncounterActorDead; // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier)> OnEncounterEnded;       // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ALivingWorldEncounterPrefab> EncounterPrefab;                               // 0x0210(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void EndAndCleanupAllMobEncounters();
	void EndMobEncounter(const struct FGameplayTag& MobIdentifier);
	void OnMobActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnMobActorSpawn(class AActor* SpawnedActor);
	void OnMobPawnEndPlay(class AActor* Mob, EEndPlayReason EndPlayReason);
	void PauseMobEncounter(const struct FGameplayTag& MobIdentifier);
	void ResumeMobEncounter(const struct FGameplayTag& MobIdentifier);
	bool StartMobEncounter(const struct FGameplayTag& MobIdentifier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterMobManagerComponent">();
	}
	static class UEncounterMobManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterMobManagerComponent>();
	}
};

// Class EncountersRuntime.StartLWMEncounterDelegateHandler
// 0x0008 (0x0030 - 0x0028)
class UStartLWMEncounterDelegateHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMobActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnMobActorSpawn(class AActor* SpawnedActor);
	void OnMobPawnEndPlay(class AActor* Mob, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StartLWMEncounterDelegateHandler">();
	}
	static class UStartLWMEncounterDelegateHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartLWMEncounterDelegateHandler>();
	}
};

// Class EncountersRuntime.EncounterActorSpawnerData
// 0x0038 (0x0088 - 0x0050)
class UEncounterActorSpawnerData final : public UFortAthenaActorSpawnerData
{
public:
	struct FEncounterPrefabEntry                  EncounterEntry;                                    // 0x0050(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterActorSpawnerData">();
	}
	static class UEncounterActorSpawnerData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterActorSpawnerData>();
	}
};

// Class EncountersRuntime.EncounterBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UEncounterBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UEncounterMobManagerComponent* GetRelevantMobManagerComponentForActor(const class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterBlueprintLibrary">();
	}
	static class UEncounterBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterBlueprintLibrary>();
	}
};

// Class EncountersRuntime.EncounterGameplayVolume
// 0x0078 (0x03A8 - 0x0330)
class AEncounterGameplayVolume final : public AGameplayVolume
{
public:
	uint8                                         Pad_330[0x18];                                     // 0x0330(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShouldPersist;                                    // 0x0348(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_349[0x1F];                                     // 0x0349(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x0368(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEncounterStateTreeComponent*           EncounterStateTreeComponent;                       // 0x0378(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_380[0x28];                                     // 0x0380(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCleanup();

	bool IsDoneCleaningUp() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterGameplayVolume">();
	}
	static class AEncounterGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEncounterGameplayVolume>();
	}
};

// Class EncountersRuntime.EncounterItem
// 0x0020 (0x00A8 - 0x0088)
class UEncounterItem final : public UFortItem
{
public:
	class UEncounterItemDefinition*               EncounterItemDefinition;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class ALivingWorldEncounterPrefab> EncounterPrefab;                               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UEncounterManagerComponent> EncounterManager;                               // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterItem">();
	}
	static class UEncounterItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterItem>();
	}
};

// Class EncountersRuntime.EncounterItemDefinition
// 0x0138 (0x04B0 - 0x0378)
class UEncounterItemDefinition final : public UFortItemDefinition
{
public:
	bool                                          bAutoHandleSuccessFailure;                         // 0x0378(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0380(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStateTree*                             StateTreeOverride;                                 // 0x03A0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        ProximityGameplayCueTag;                           // 0x03A8(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        ActorCleanupGameplayCueTag;                        // 0x03AC(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           SuccessRewards;                                    // 0x03B0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FEncounterRewardBehavior               SuccessRewardBehavior;                             // 0x03C0(0x0038)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        ActorSuccessGameplayCueTag;                        // 0x03F8(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        PlayerSuccessGameplayCueTag;                       // 0x03FC(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           FailureRewards;                                    // 0x0400(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FEncounterRewardBehavior               FailureRewardBehavior;                             // 0x0410(0x0038)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        ActorFailureGameplayCueTag;                        // 0x0448(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        PlayerFailureGameplayCueTag;                       // 0x044C(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         LWMDensityWeight;                                  // 0x0450(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         LWMDensityRange;                                   // 0x0478(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FInstancedStruct>               Vars;                                              // 0x04A0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterItemDefinition">();
	}
	static class UEncounterItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterItemDefinition>();
	}
};

// Class EncountersRuntime.EncounterManagerComponent
// 0x0068 (0x0108 - 0x00A0)
class UEncounterManagerComponent final : public UGameFrameworkComponent
{
public:
	TWeakObjectPtr<class AEncounterGameplayVolume> EncounterVolume;                                  // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  CenterActorOverride;                               // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class APlayerController*>                ExplicitContributors;                              // 0x00B0(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UEncounterItem>          EncounterItem;                                     // 0x0100(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AddExplicitContributor(class APlayerController* Contributor);
	void HandleEncounterFailure(int32 RewardIndex);
	void HandleEncounterSuccess(int32 RewardIndex);
	void OnStateTreeStatusChanged(EStateTreeRunStatus Status);
	void RemoveExplicitContributor(class APlayerController* Contributor);

	bool GetVariable_Bool(const struct FGameplayTag& VarName) const;
	float GetVariable_Float(const struct FGameplayTag& VarName) const;
	struct FGameplayTag GetVariable_GameplayTag(const struct FGameplayTag& VarName) const;
	int32 GetVariable_Int(const struct FGameplayTag& VarName) const;
	const class UFortWorldItemDefinition* GetVariable_ItemDefinition(const struct FGameplayTag& VarName) const;
	const class UFortAthenaLivingWorldEncounter* GetVariable_LWMEncounter(const struct FGameplayTag& VarName) const;
	struct FGameplayTagQuery GetVariable_TagQuery(const struct FGameplayTag& VarName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterManagerComponent">();
	}
	static class UEncounterManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterManagerComponent>();
	}
};

// Class EncountersRuntime.EncounterStateTreeComponent
// 0x0000 (0x0148 - 0x0148)
class UEncounterStateTreeComponent final : public UStateTreeComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterStateTreeComponent">();
	}
	static class UEncounterStateTreeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterStateTreeComponent>();
	}
};

// Class EncountersRuntime.LivingWorldEncounterPrefab
// 0x0060 (0x0978 - 0x0918)
class ALivingWorldEncounterPrefab final : public AFortAthenaLivingWorldPrefab
{
public:
	uint8                                         Pad_918[0x40];                                     // 0x0918(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEncounterPrefabEntry>          EncounterEntries;                                  // 0x0958(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UEncounterItem*                         EncounterItem;                                     // 0x0968(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UEncounterItemDefinition> EncounterDefinition;                              // 0x0970(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_EncounterDefinition();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LivingWorldEncounterPrefab">();
	}
	static class ALivingWorldEncounterPrefab* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALivingWorldEncounterPrefab>();
	}
};

}

