#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoudPhoenix_Axe_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass LoudPhoenix_Axe_AnimBP.LoudPhoenix_Axe_AnimBP_C
// 0x00F0 (0x07F0 - 0x0700)
class ULoudPhoenix_Axe_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_6F8[0x8];                                      // 0x06F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0708(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0710(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0718(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0738(0x00B0)()

public:
	void ExecuteUbergraph_LoudPhoenix_Axe_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoudPhoenix_Axe_AnimBP_C">();
	}
	static class ULoudPhoenix_Axe_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoudPhoenix_Axe_AnimBP_C>();
	}
};

}

