#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingPortalUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Class MatchmakingPortalUI.FortMatchmakingPortalCountdown
// 0x0030 (0x0430 - 0x0400)
class UFortMatchmakingPortalCountdown final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        MatchmakingPortalInputComponent;                   // 0x0408(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityScalingTextBlock*          Text_IslandName;                                   // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CountdownTime;                                     // 0x0418(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedCountdown;                               // 0x0420(0x0010)(ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	void FinishTimer();
	void HandleCancelClicked();
	void StartCountdown();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMatchmakingPortalCountdown">();
	}
	static class UFortMatchmakingPortalCountdown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMatchmakingPortalCountdown>();
	}
};

// Class MatchmakingPortalUI.FortMatchmakingPortalModal
// 0x03E0 (0x0830 - 0x0450)
class UFortMatchmakingPortalModal final : public UFortActivityView
{
public:
	struct FTimerHandle                           MatchmakingStartTimerHandle;                       // 0x0450(0x0008)(BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_458[0x368];                                    // 0x0458(0x0368)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         XpTagMnemonicWhitelist;                            // 0x07C0(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_ActivityOrigin;                               // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_LinkCode;                                     // 0x07D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x07E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ActivityDescription;                          // 0x07E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_ActivityDescription;                     // 0x07F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_ActivityTags;                             // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSimpleMaterialProgressBar*         ProgressBar_ContentDownload;                       // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_AcceptPublic;                               // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_AcceptPrivate;                              // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Favorite;                                   // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Cancel;                                     // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortModalBackground*                   ModalBackground;                                   // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class FText GetCodeTextFormat(const class FText& IslandCode);
	class FText GetCreatorTextFormat(const class FText& CreatorName);
	void HandleOnMatchmakingError();
	void OnAdditionalContentUpdate(const class FText& MatchmakingState, const float Progress, bool bShowProgressBar);
	void OnMatchmakingStarted(const class FText& MatchmakingState);
	void OnMatchmakingStopped();
	void SendLinkCodeToParty();
	void SetMatchmakingStateText(const class FText& MatchmakingStateText);
	void SetMatchmakingTimer();

	TArray<class FString> GetContentWarningStrings() const;
	EFortInvalidActivityReason GetInvalidActivityReason() const;
	bool IsDownloadRequired() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMatchmakingPortalModal">();
	}
	static class UFortMatchmakingPortalModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMatchmakingPortalModal>();
	}
};

// Class MatchmakingPortalUI.FortMatchmakingPortalPopup
// 0x0128 (0x0530 - 0x0408)
class UFortMatchmakingPortalPopup final : public UFortPortalHUDDetails
{
public:
	uint8                                         Pad_408[0x10];                                     // 0x0408(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivity*                      CachedGameActivity;                                // 0x0418(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMatchmakingPortalModal*            MatchmakingPortalModalWidget;                      // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonActivatableWidget>   MatchmakingFeedbackClass;                          // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortMatchmakingPortalCountdown> MatchmakingCountdownClass;                    // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                WorldPointerLocation;                              // 0x0438(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CreatorNameTextFormat;                             // 0x0450(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UHeaderDescriptionHUDComponent> CachedHUDComponent;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMatchmakingPortalModal> IslandModal;                                      // 0x0470(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchmakingPortalPopupData            CachedIslandData;                                  // 0x0478(0x0060)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   InvalidLinkCodeWarningText;                        // 0x04D8(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         MatchmakingFeedbackDelayTime;                      // 0x04F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsWithinPortalRange : 1;                          // 0x04F4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_4F5[0x3];                                      // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingPortalCountdown*        MatchmakingCountdownWidget;                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActivatableWidget*               MatchmakingFeedbackContainerWidget;                // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaCreativeMatchmakingWidget*   MatchmakingFeedbackWidget;                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_CreatorName;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_IslandName;                                   // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_ActivityTags;                             // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     GlobalActionKeybindWidget;                         // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BindOverlapEvents();
	bool GetIslandData(struct FMatchmakingPortalPopupData* OutIslandData, class UHeaderDescriptionHUDComponent* HUDComponent);
	void HandleFinishedCountdown();
	void HandleHUDShow(const bool bShow, const bool bShouldAnimate);
	void HandleLoadScreenChanged(class AFortPlayerControllerAthena* PlayerController, bool bLoadScreenEnabled, const class FText& HUDReason);
	void HandleOnPortalDetailsVisibilityCheck(bool bShowWidget);
	void HandleStartedRespawn(class AFortPlayerControllerZone* PlayerController);
	void HandleWidgetUpdate();
	bool IsInteractingDeviceAMatchmakingPortal();
	void OnPlayerCanInteractChanged(const bool bPlayerCanInteract);
	void OnShowPortalPopup(const bool bShow, const bool bAnimate);
	void UpdateVisuals(const class UHeaderDescriptionHUDComponent* HUDComponent);

	class UFortAthenaCreativeMatchmakingWidget* GetMatchmakingFeedbackWidget(const class UCommonActivatableWidget* MatchmakingFeedbackContainer) const;
	bool HasActivityToShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMatchmakingPortalPopup">();
	}
	static class UFortMatchmakingPortalPopup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMatchmakingPortalPopup>();
	}
};

// Class MatchmakingPortalUI.FortModalBackground
// 0x0038 (0x0438 - 0x0400)
class UFortModalBackground final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x20];                                     // 0x0400(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Back;                                       // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_BackBoard;                                  // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* InTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortModalBackground">();
	}
	static class UFortModalBackground* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortModalBackground>();
	}
};

// Class MatchmakingPortalUI.FortUIGameFeatureAction_OverridePortalHUDDetails
// 0x0020 (0x0048 - 0x0028)
class UFortUIGameFeatureAction_OverridePortalHUDDetails final : public UFortUIGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   SoftPortalHUDDetailsClass;                         // 0x0028(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIGameFeatureAction_OverridePortalHUDDetails">();
	}
	static class UFortUIGameFeatureAction_OverridePortalHUDDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIGameFeatureAction_OverridePortalHUDDetails>();
	}
};

}

