#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionTrajectory

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "PoseSearch_structs.hpp"


namespace SDK
{

// Class MotionTrajectory.CharacterTrajectoryComponent
// 0x0090 (0x0130 - 0x00A0)
class alignas(0x10) UCharacterTrajectoryComponent final : public UActorComponent
{
public:
	struct FPoseSearchQueryTrajectory             Trajectory;                                        // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         HistoryLengthSeconds;                              // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         HistorySamplesPerSecond;                           // 0x00B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PredictionLengthSeconds;                           // 0x00B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PredictionSamplesPerSecond;                        // 0x00BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RotateTowardsMovementSpeed;                        // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoUpdateTrajectory;                             // 0x00C4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxControllerRotationRate;                         // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SkelMeshComponent;                                 // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCharacterMovementComponent*            CharacterMovementComponent;                        // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x50];                                      // 0x00E0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMovementUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void UpdateTrajectory(float DeltaSeconds);

	struct FRotator GetFacingFromMeshComponent(const class USkeletalMeshComponent* MeshComponent) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterTrajectoryComponent">();
	}
	static class UCharacterTrajectoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterTrajectoryComponent>();
	}
};

// Class MotionTrajectory.CharacterMovementTrajectoryLibrary
// 0x0000 (0x0028 - 0x0028)
class UCharacterMovementTrajectoryLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void StepCharacterMovementGroundPrediction(float InDeltaTime, const struct FVector& InVelocity, const struct FVector& InAcceleration, const class UCharacterMovementComponent* InCharacterMovementComponent, struct FVector* OutVelocity);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterMovementTrajectoryLibrary">();
	}
	static class UCharacterMovementTrajectoryLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterMovementTrajectoryLibrary>();
	}
};

}

