#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mover

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Mover_structs.hpp"
#include "NetworkPrediction_classes.hpp"
#include "AnimGraphRuntime_classes.hpp"


namespace SDK
{

// Class Mover.MoverBackendLiaisonInterface
// 0x0000 (0x0000 - 0x0000)
class IMoverBackendLiaisonInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoverBackendLiaisonInterface">();
	}
	static class IMoverBackendLiaisonInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMoverBackendLiaisonInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class Mover.MoverBasePawn
// 0x0010 (0x0328 - 0x0318)
class AMoverBasePawn final : public APawn
{
public:
	class UKinematicMoverComponent*               CharacterMotionComponent;                          // 0x0318(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FKinematicMoverInputCmdContext OnProduceInputInBlueprint(float DeltaMs, const struct FKinematicMoverInputCmdContext& InputCmd);

	class UKinematicMoverComponent* GetMoverComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoverBasePawn">();
	}
	static class AMoverBasePawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoverBasePawn>();
	}
};

// Class Mover.MoverBlackboard
// 0x0050 (0x0078 - 0x0028)
class UMoverBlackboard final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoverBlackboard">();
	}
	static class UMoverBlackboard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverBlackboard>();
	}
};

// Class Mover.MoverDataModelBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMoverDataModelBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector GetLocationFromSyncState(const struct FMoverDefaultSyncState& SyncState);
	static struct FVector GetMoveDirectionIntentFromInputs(const struct FKinematicDefaultInputs& Inputs);
	static struct FVector GetMoveDirectionIntentFromSyncState(const struct FMoverDefaultSyncState& SyncState);
	static struct FRotator GetOrientationFromSyncState(const struct FMoverDefaultSyncState& SyncState);
	static struct FVector GetVelocityFromSyncState(const struct FMoverDefaultSyncState& SyncState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoverDataModelBlueprintLibrary">();
	}
	static class UMoverDataModelBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverDataModelBlueprintLibrary>();
	}
};

// Class Mover.MoverNetworkPhysicsLiaisonComponent
// 0x0098 (0x0138 - 0x00A0)
class UMoverNetworkPhysicsLiaisonComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x98];                                      // 0x00A0(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoverNetworkPhysicsLiaisonComponent">();
	}
	static class UMoverNetworkPhysicsLiaisonComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverNetworkPhysicsLiaisonComponent>();
	}
};

// Class Mover.MoverNetworkPredictionLiaisonComponent
// 0x0010 (0x02A0 - 0x0290)
class UMoverNetworkPredictionLiaisonComponent final : public UNetworkPredictionComponent
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoverNetworkPredictionLiaisonComponent">();
	}
	static class UMoverNetworkPredictionLiaisonComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverNetworkPredictionLiaisonComponent>();
	}
};

// Class Mover.MoverDataCollectionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMoverDataCollectionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void K2_AddDataToCollection(struct FMoverDataCollection& Collection, const int32& SourceAsRawBytes);
	static void K2_GetDataFromCollection(bool* DidSucceed, const struct FMoverDataCollection& Collection, int32* TargetAsRawBytes);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoverDataCollectionLibrary">();
	}
	static class UMoverDataCollectionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoverDataCollectionLibrary>();
	}
};

// Class Mover.PhysicsCharacterMovementModeInterface
// 0x0000 (0x0000 - 0x0000)
class IPhysicsCharacterMovementModeInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsCharacterMovementModeInterface">();
	}
	static class IPhysicsCharacterMovementModeInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPhysicsCharacterMovementModeInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class Mover.KinematicMoverComponent
// 0x01D8 (0x0278 - 0x00A0)
class UKinematicMoverComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FMoverTimeStep& TimeStep, const struct FKinematicMoverInputCmdContext& InputCmd)> OnPreSimulationTick; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMoverTimeStep& TimeStep)> OnPostSimulationTick;      // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMoverTimeStep& CurrentTimeStep, const struct FMoverTimeStep& ExpungedTimeStep)> OnPostSimulationRollback; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorComponent>            BackendClass;                                      // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKinematicMoverAuxStateContext         InitialAuxState;                                   // 0x00E8(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMap<class FName, class UBaseMovementMode*>   MovementModes;                                     // 0x0128(0x0050)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class FName                                   StartingMovementMode;                              // 0x0178(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HistoryTrackingSeconds;                            // 0x017C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         HistorySamplesPerSecond;                           // 0x0180(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_184[0x1C];                                     // 0x0184(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        UpdatedComponent;                                  // 0x01A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    UpdatedPrimitive;                                  // 0x01A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B0[0xA8];                                     // 0x01B0(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementModeStateMachine*              ModeFSM;                                           // 0x0258(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoverBlackboard*                       SimBlackboard;                                     // 0x0260(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_268[0x10];                                     // 0x0268(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_QueueLayeredMove(const int32& MoveAsRawData);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnHistoryTrackingRollback(const struct FMoverTimeStep& NewTimeStep, const struct FMoverTimeStep& InvalidatedTimeStep);
	void PhysicsVolumeChanged(class APhysicsVolume* NewVolume);
	void SetHistoryTracking(float SecondsToTrack, float SamplesPerSecond);

	TArray<struct FTrajectorySampleInfo> GetFutureTrajectory(float FutureSeconds, float SamplesPerSecond) const;
	const struct FKinematicMoverInputCmdContext GetLastInputCmd() const;
	class UPrimitiveComponent* GetMovementBase() const;
	class FName GetMovementBaseBoneName() const;
	struct FVector GetMovementIntent() const;
	class FName GetMovementModeName() const;
	TArray<struct FTrajectorySampleInfo> GetPastTrajectory() const;
	const struct FKinematicMoverSyncState GetSyncState() const;
	struct FRotator GetTargetOrientation() const;
	struct FVector GetVelocity() const;
	bool HasValidCachedInputCmd() const;
	bool HasValidCachedState() const;
	bool IsAirborne() const;
	bool IsFalling() const;
	bool IsOnGround() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KinematicMoverComponent">();
	}
	static class UKinematicMoverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKinematicMoverComponent>();
	}
};

// Class Mover.BaseMovementMode
// 0x0008 (0x0030 - 0x0028)
class UBaseMovementMode : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_OnRegistered(const class FName ModeName);
	struct FKinematicMoverTickEndData K2_OnSimulationTick(const struct FSimulationTickParams& Params_0);
	void K2_OnUnregistered();

	const class UMoverBlackboard* GetBlackboard() const;
	class UMoverBlackboard* GetBlackboard_Mutable() const;
	struct FProposedMove K2_OnGenerateMove(const struct FKinematicMoverTickStartData& StartState, const struct FMoverTimeStep& TimeStep) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseMovementMode">();
	}
	static class UBaseMovementMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMovementMode>();
	}
};

// Class Mover.FallingMode
// 0x0030 (0x0060 - 0x0030)
class UFallingMode : public UBaseMovementMode
{
public:
	float                                         AirControlPercentage;                              // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallingDeceleration;                               // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverTerminalSpeedFallingDeceleration;              // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TerminalMovementPlaneSpeed;                        // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalFallingDeceleration;                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TerminalVerticalSpeed;                             // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GravityAcceleration;                               // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnSimulationTick(const struct FSimulationTickParams& Params_0, struct FKinematicMoverTickEndData* OutputState);

	void OnGenerateMove(const struct FKinematicMoverTickStartData& StartState, const struct FMoverTimeStep& TimeStep, struct FProposedMove* OutProposedMove) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FallingMode">();
	}
	static class UFallingMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFallingMode>();
	}
};

// Class Mover.FlyingMode
// 0x0000 (0x0030 - 0x0030)
class UFlyingMode final : public UBaseMovementMode
{
public:
	void OnSimulationTick(const struct FSimulationTickParams& Params_0, struct FKinematicMoverTickEndData* OutputState);

	void OnGenerateMove(const struct FKinematicMoverTickStartData& StartState, const struct FMoverTimeStep& TimeStep, struct FProposedMove* OutProposedMove) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlyingMode">();
	}
	static class UFlyingMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlyingMode>();
	}
};

// Class Mover.WalkingMode
// 0x0000 (0x0030 - 0x0030)
class UWalkingMode : public UBaseMovementMode
{
public:
	void OnSimulationTick(const struct FSimulationTickParams& Params_0, struct FKinematicMoverTickEndData* OutputState);

	void OnGenerateMove(const struct FKinematicMoverTickStartData& StartState, const struct FMoverTimeStep& TimeStep, struct FProposedMove* OutProposedMove) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WalkingMode">();
	}
	static class UWalkingMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWalkingMode>();
	}
};

// Class Mover.MovementBaseUtils
// 0x0000 (0x0028 - 0x0028)
class UMovementBaseUtils final : public UBlueprintFunctionLibrary
{
public:
	static bool GetMovementBaseTransform(const class UPrimitiveComponent* MovementBase, const class FName BoneName, struct FVector* OutLocation, struct FQuat* OutQuat);
	static bool IsADynamicBase(const class UPrimitiveComponent* MovementBase);
	static bool TransformBasedDirectionToWorld(const class UPrimitiveComponent* MovementBase, const class FName BoneName, const struct FVector& LocalDirection, struct FVector* OutDirectionWorldSpace);
	static bool TransformBasedLocationToWorld(const class UPrimitiveComponent* MovementBase, const class FName BoneName, const struct FVector& LocalLocation, struct FVector* OutLocationWorldSpace);
	static bool TransformBasedRotatorToWorld(const class UPrimitiveComponent* MovementBase, const class FName BoneName, const struct FRotator& LocalRotator, struct FRotator* OutWorldSpaceRotator);
	static void TransformDirectionToLocal(const struct FQuat& BaseQuat, const struct FVector& WorldSpaceDirection, struct FVector* OutLocalDirection);
	static void TransformDirectionToWorld(const struct FQuat& BaseQuat, const struct FVector& LocalDirection, struct FVector* OutDirectionWorldSpace);
	static void TransformLocationToLocal(const struct FVector& BasePos, const struct FQuat& BaseQuat, const struct FVector& WorldSpaceLocation, struct FVector* OutLocalLocation);
	static void TransformLocationToWorld(const struct FVector& BasePos, const struct FQuat& BaseQuat, const struct FVector& LocalLocation, struct FVector* OutLocationWorldSpace);
	static void TransformRotatorToLocal(const struct FQuat& BaseQuat, const struct FRotator& WorldSpaceRotator, struct FRotator* OutLocalRotator);
	static void TransformRotatorToWorld(const struct FQuat& BaseQuat, const struct FRotator& LocalRotator, struct FRotator* OutWorldSpaceRotator);
	static bool TransformWorldDirectionToBased(const class UPrimitiveComponent* MovementBase, const class FName BoneName, const struct FVector& WorldSpaceDirection, struct FVector* OutLocalDirection);
	static bool TransformWorldLocationToBased(const class UPrimitiveComponent* MovementBase, const class FName BoneName, const struct FVector& WorldSpaceLocation, struct FVector* OutLocalLocation);
	static bool TransformWorldRotatorToBased(const class UPrimitiveComponent* MovementBase, const class FName BoneName, const struct FRotator& WorldSpaceRotator, struct FRotator* OutLocalRotator);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovementBaseUtils">();
	}
	static class UMovementBaseUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovementBaseUtils>();
	}
};

// Class Mover.MovementUtils
// 0x0000 (0x0028 - 0x0028)
class UMovementUtils final : public UBlueprintFunctionLibrary
{
public:
	static void AdjustProposedMoveForRootMotion(struct FProposedMove* MoveToAdjust, class USkeletalMeshComponent* SkeletalMesh, const struct FVector& GroundNormal, float DeltaSeconds);
	static bool CanStepUpOnHitSurface(const struct FHitResult& Hit);
	static struct FRotator ComputeAngularVelocity(const struct FRotator& From, const struct FRotator& To, float DeltaSeconds, float TurningRateLimit);
	static struct FProposedMove ComputeControlledFreeMove(const struct FFreeMoveParams& InParams);
	static struct FProposedMove ComputeControlledGroundMove(const struct FGroundMoveParams& InParams);
	static struct FVector ComputeDeflectedMoveOntoRamp(const struct FVector& OrigMoveDelta, const struct FHitResult& RampHitResult, float MaxWalkSlopeCosine, const bool bHitFromLineTrace);
	static struct FVector ComputeDirectionIntent(const struct FVector& MoveInput, EMoveInputType MoveInputType);
	static struct FVector ComputeSlideDelta(const struct FVector& Delta, const float PctOfDeltaToMove, const struct FVector& Normal, const struct FHitResult& Hit);
	static struct FVector ComputeVelocity(const struct FComputeVelocityParams& InParams);
	static struct FVector ComputeVelocityFromGravity(const struct FVector& GravityAccel, float DeltaSeconds);
	static struct FVector ComputeVelocityFromPositions(const struct FVector& FromPos, const struct FVector& ToPos, float DeltaSeconds);
	static struct FVector ConstrainToPlane(const struct FVector& Vector, const struct FPlane& MovementPlane, bool bMaintainMagnitude);
	static bool IsExceedingMaxSpeed(const struct FVector& Velocity, float InMaxSpeed);
	static bool IsHitSurfaceWalkable(const struct FHitResult& Hit, float MaxWalkSlopeCosine);
	static bool IsValidLandingSpot(class USceneComponent* UpdatedComponent, class UPrimitiveComponent* UpdatedPrimitive, const struct FVector& Location, const struct FHitResult& Hit, float FloorSweepDistance, float MaxWalkSlopeCosine, struct FFloorCheckResult* OutFloorResult);
	static float TryMoveToFallAlongSurface(class USceneComponent* UpdatedComponent, class UPrimitiveComponent* UpdatedPrimitive, const struct FVector& Delta, float PctOfDeltaToMove, const struct FQuat& Rotation, const struct FVector& Normal, struct FHitResult* Hit, bool bHandleImpact, float FloorSweepDistance, float MaxWalkSlopeCosine, struct FFloorCheckResult* OutFloorResult, struct FMovementRecord* MoveRecord);
	static float TryMoveToSlideAlongSurface(class USceneComponent* UpdatedComponent, class UPrimitiveComponent* UpdatedPrimitive, const struct FVector& Delta, float PctOfDeltaToMove, const struct FQuat& Rotation, const struct FVector& Normal, struct FHitResult* Hit, bool bHandleImpact, struct FMovementRecord* MoveRecord);
	static bool TrySafeMoveUpdatedComponent(class USceneComponent* UpdatedComponent, class UPrimitiveComponent* UpdatedPrimitive, const struct FVector& Delta, const struct FQuat& NewRotation, bool bSweep, struct FHitResult* OutHit, ETeleportType Teleport, struct FMovementRecord* MoveRecord);
	static float TryWalkToSlideAlongSurface(class USceneComponent* UpdatedComponent, class UPrimitiveComponent* UpdatedPrimitive, const struct FVector& Delta, float PctOfDeltaToMove, const struct FQuat& Rotation, const struct FVector& Normal, struct FHitResult* Hit, bool bHandleImpact, struct FMovementRecord* MoveRecord, float MaxWalkSlopeCosine);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovementUtils">();
	}
	static class UMovementUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovementUtils>();
	}
};

// Class Mover.PlayMoverMontageCallbackProxy
// 0x0000 (0x00A8 - 0x00A8)
class UPlayMoverMontageCallbackProxy final : public UPlayMontageCallbackProxy
{
public:
	static class UPlayMoverMontageCallbackProxy* CreateProxyObjectForPlayMoverMontage(class UKinematicMoverComponent* InMoverComponent, class UAnimMontage* MontageToPlay, float PlayRate, float StartingPosition, class FName StartingSection);

	void OnMoverMontageEnded(class FName IgnoredNotifyName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayMoverMontageCallbackProxy">();
	}
	static class UPlayMoverMontageCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayMoverMontageCallbackProxy>();
	}
};

// Class Mover.NullMovementMode
// 0x0000 (0x0030 - 0x0030)
class UNullMovementMode final : public UBaseMovementMode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NullMovementMode">();
	}
	static class UNullMovementMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNullMovementMode>();
	}
};

// Class Mover.MovementModeStateMachine
// 0x0070 (0x0098 - 0x0028)
class UMovementModeStateMachine final : public UObject
{
public:
	TMap<class FName, class UBaseMovementMode*>   Modes;                                             // 0x0028(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x20];                                      // 0x0078(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovementModeStateMachine">();
	}
	static class UMovementModeStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovementModeStateMachine>();
	}
};

// Class Mover.PhysicsDrivenFallingMode
// 0x0020 (0x0080 - 0x0060)
class UPhysicsDrivenFallingMode final : public UFallingMode
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TwistTorqueLimit;                                  // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwingTorqueLimit;                                  // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetHeight;                                      // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloorSweepDistance;                                // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloorSweepRadius;                                  // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsDrivenFallingMode">();
	}
	static class UPhysicsDrivenFallingMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsDrivenFallingMode>();
	}
};

// Class Mover.PhysicsDrivenWalkingMode
// 0x0030 (0x0060 - 0x0030)
class UPhysicsDrivenWalkingMode final : public UWalkingMode
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RadialForceLimit;                                  // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrictionForceLimit;                                // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TwistTorqueLimit;                                  // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwingTorqueLimit;                                  // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetHeight;                                      // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloorSweepDistance;                                // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloorSweepRadius;                                  // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CharacterRadius;                                   // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundDamping;                                     // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FractionalVelocityToTarget;                        // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsDrivenWalkingMode">();
	}
	static class UPhysicsDrivenWalkingMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsDrivenWalkingMode>();
	}
};

// Class Mover.PhysicsMoverManager
// 0x0020 (0x0050 - 0x0030)
class UPhysicsMoverManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsMoverManager">();
	}
	static class UPhysicsMoverManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsMoverManager>();
	}
};

}

