#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MPItemShop_VaultWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VaultWorld_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MPItemShop_VaultWorld.MPItemShop_VaultWorld_C
// 0x0058 (0x03A0 - 0x0348)
class AMPItemShop_VaultWorld_C final : public AVaultWorld_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MPItemShop_VaultWorld_C;            // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   floor;                                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FloorVisibility_FloorMask_33DB417F4F318DD14C0CDB92ED647F56; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FloorVisibility__Direction_33DB417F4F318DD14C0CDB92ED647F56; // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FloorVisibility;                                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_FX_Transition_Fade_A94F40F44CC1E033CF6C509AB9A33280; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Forward_A94F40F44CC1E033CF6C509AB9A33280; // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionForward__Direction_A94F40F44CC1E033CF6C509AB9A33280; // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionForward;                                 // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DefaultBackgroundMaterial;                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DefaultFloorMaterial;                              // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Background;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsMaterialBackground;                              // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void TransitionForward__UpdateFunc();
	void TransitionForward__FinishedFunc();
	void TransitionBackgroundForward(double Forward, double FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void TransitionBackgroundBackward(double Backward, double FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void StopTransitions();
	void SetupBackgroundMaterial(class UTexture2D*& TextureBackground, class UMaterialInstanceDynamic* Mid, bool IsFloor, bool FirstTimeSetup);
	void ReceiveBeginPlay();
	void OnUpdateDisplay(bool bShowFloor, bool bShowEffects);
	void OnTransitionBackground(bool bPlayForward, EBackgroundIntensityLevel IntensityTransition);
	void OnSetupTextureBackground(const class UTexture2D* LoadedBackgroundTexture, const struct FVaultWorldBackgroundData& BackgroundInfo);
	void OnSetupMaterialBackground(const class UMaterialInterface* LoadedBackgroundMaterial, const struct FVaultWorldBackgroundData& BackgroundInfo);
	void OnInitialBackgroundTransition();
	void HandleTextureBackground(class UTexture2D*& TextureBackground);
	void HandleMaterialBackground(const class UMaterialInterface* MaterialBackground);
	void GetBackground();
	void FloorVisibility__UpdateFunc();
	void AssignFloorMaterial(class UMaterialInterface* SourceMaterial);
	void AssignBackgroundMaterial(class UMaterialInterface* SourceMaterial);
	void FloorVisibility__FinishedFunc();
	void ExecuteUbergraph_MPItemShop_VaultWorld(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MPItemShop_VaultWorld_C">();
	}
	static class AMPItemShop_VaultWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMPItemShop_VaultWorld_C>();
	}
};

}

