#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RocketRamGameplayRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class RocketRamGameplayRuntime.AbilityTask_ApplyRootMotion_RocketRam
// 0x0050 (0x0150 - 0x0100)
class UAbilityTask_ApplyRootMotion_RocketRam final : public UAbilityTask_ApplyRootMotionConstantForce
{
public:
	struct FVector                                InitialDirection;                                  // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                EndingDirection;                                   // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinSpeed;                                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxSpeed;                                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            SpeedCurve;                                        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FloorTraceHeight;                                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           PathOffsetCurve;                                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UAbilityTask_ApplyRootMotion_RocketRam* ApplyRootMotion_RocketRam(class UGameplayAbility* InOwningAbility, class FName InTaskInstanceName, float InDuration, const struct FVector& InInitialDirection, const struct FVector& InEndingDirection, float InMinSpeed, float InMaxSpeed, class UCurveFloat* InSpeedCurve, float InFloorTraceHeight, class UCurveVector* InPathOffsetCurve, ERootMotionFinishVelocityMode InVelocityOnFinishMode, const struct FVector& InSetVelocityOnFinish, float InClampVelocityOnFinish);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_ApplyRootMotion_RocketRam">();
	}
	static class UAbilityTask_ApplyRootMotion_RocketRam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_ApplyRootMotion_RocketRam>();
	}
};

}

