#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarRight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarRight.SidebarRight_C
// 0x0098 (0x0730 - 0x0698)
class USidebarRight_C final : public UFortSocialPanelView_Sidebar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USidebarProfile_C*                      Panel_Profile;                                     // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              Safezone_OnboardingTooltip;                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_SideBar;                                  // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarOnboardingLookingForPartyRight_C* SidebarOnboardingLookingForPartyRight;           // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarOnboardingTagsEditTooltipRight_C* SidebarOnboardingTagsEditTooltipRight;           // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USiderbarSupervisedSettingsTooltipRight_C* SiderbarSupervisedSettingsTooltipRight;         // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_PartyUp;                                      // 0x06D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_FindFriends;                                  // 0x06E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_VoiceChat;                                    // 0x0700(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_UserSettings;                                 // 0x0718(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_SidebarRight(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarRight_C">();
	}
	static class USidebarRight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarRight_C>();
	}
};

}

