#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsExperimental

#include "Basic.hpp"

#include "SpatialMetricsCore_classes.hpp"
#include "SpatialMetricsExperimental_structs.hpp"
#include "SpatialMetrics_structs.hpp"


namespace SDK
{

// Class SpatialMetricsExperimental.ActorPackageDependencyARDiskSizeMetric_Archive
// 0x0350 (0x0390 - 0x0040)
class UActorPackageDependencyARDiskSizeMetric_Archive final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x350];                                     // 0x0040(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyARDiskSizeMetric_Archive">();
	}
	static class UActorPackageDependencyARDiskSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyARDiskSizeMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.ActorPackageDependencyCountMetric_Archive
// 0x0348 (0x0388 - 0x0040)
class UActorPackageDependencyCountMetric_Archive final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x348];                                     // 0x0040(0x0348)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyCountMetric_Archive">();
	}
	static class UActorPackageDependencyCountMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyCountMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.ActorPackageDependencyIoDispatcherSizeMetric_Archive
// 0x0358 (0x0398 - 0x0040)
class UActorPackageDependencyIoDispatcherSizeMetric_Archive final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x350];                                     // 0x0040(0x0350)(Fixing Size After Last Property [ Dumper-7 ])
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyIoDispatcherSizeMetric_Archive">();
	}
	static class UActorPackageDependencyIoDispatcherSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyIoDispatcherSizeMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.ActorPackageDependencyResourceSizeMetric_Archive
// 0x0358 (0x0398 - 0x0040)
class UActorPackageDependencyResourceSizeMetric_Archive final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x350];                                     // 0x0040(0x0350)(Fixing Size After Last Property [ Dumper-7 ])
	EResourceSizeMemoryCategory                   MemoryCategoryFlags;                               // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyResourceSizeMetric_Archive">();
	}
	static class UActorPackageDependencyResourceSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyResourceSizeMetric_Archive>();
	}
};

}

