#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsCore

#include "Basic.hpp"

#include "SpatialMetricsCore_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SpatialMetricsCore.SpatialMetricsActorIndexerSubscriber
// 0x0000 (0x0000 - 0x0000)
class ISpatialMetricsActorIndexerSubscriber final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsActorIndexerSubscriber">();
	}
	static class ISpatialMetricsActorIndexerSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsActorIndexerSubscriber>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class SpatialMetricsCore.SpatialMetricsActorTrackerSubscriber
// 0x0000 (0x0000 - 0x0000)
class ISpatialMetricsActorTrackerSubscriber final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsActorTrackerSubscriber">();
	}
	static class ISpatialMetricsActorTrackerSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsActorTrackerSubscriber>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class SpatialMetricsCore.SpatialMetricsSubsystemExtension
// 0x0058 (0x0080 - 0x0028)
class USpatialMetricsSubsystemExtension : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsSubsystemExtension">();
	}
	static class USpatialMetricsSubsystemExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsSubsystemExtension>();
	}
};

// Class SpatialMetricsCore.SpatialMetric
// 0x0018 (0x0040 - 0x0028)
class USpatialMetric : public UObject
{
public:
	struct FSpatialMetricProperties               Properties;                                        // 0x0028(0x0018)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetric">();
	}
	static class USpatialMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetric>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsActorIndexer
// 0x0138 (0x01B8 - 0x0080)
class USpatialMetricsActorIndexer final : public USpatialMetricsSubsystemExtension
{
public:
	uint8                                         Pad_80[0x134];                                     // 0x0080(0x0134)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexCacheSize;                                    // 0x01B4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsActorIndexer">();
	}
	static class USpatialMetricsActorIndexer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsActorIndexer>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsActorTracker
// 0x0070 (0x00F0 - 0x0080)
class USpatialMetricsActorTracker final : public USpatialMetricsSubsystemExtension
{
public:
	uint8                                         Pad_80[0x70];                                      // 0x0080(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsActorTracker">();
	}
	static class USpatialMetricsActorTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsActorTracker>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsSubsystem
// 0x0038 (0x0068 - 0x0030)
class USpatialMetricsSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USpatialMetric*>                 Metrics;                                           // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class USpatialMetricsSubsystemExtension*> Extensions;                                     // 0x0050(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	float                                         UpdateRateInSeconds;                               // 0x0060(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsSubsystem">();
	}
	static class USpatialMetricsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsSubsystem>();
	}
};

// Class SpatialMetricsCore.TestMetric
// 0x0078 (0x00B8 - 0x0040)
class UTestMetric final : public USpatialMetric
{
public:
	uint8                                         Pad_40[0x6C];                                      // 0x0040(0x006C)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SamplingDistance;                                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldSamplingFactor;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestMetric">();
	}
	static class UTestMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMetric>();
	}
};

}

