#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StreamlineBlueprint

#include "Basic.hpp"

#include "StreamlineBlueprint_structs.hpp"


namespace SDK::Params
{

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.GetDefaultDLSSGMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_GetDefaultDLSSGMode final
{
public:
	EUStreamlineDLSSGMode                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.GetDLSSGFrameTiming
// 0x0008 (0x0008 - 0x0000)
struct StreamlineLibraryDLSSG_GetDLSSGFrameTiming final
{
public:
	float                                         FrameRateInHertz;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FramesPresented;                                   // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.GetDLSSGMinimumDriverVersion
// 0x0008 (0x0008 - 0x0000)
struct StreamlineLibraryDLSSG_GetDLSSGMinimumDriverVersion final
{
public:
	int32                                         MinDriverVersionMajor;                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinDriverVersionMinor;                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.GetDLSSGMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_GetDLSSGMode final
{
public:
	EUStreamlineDLSSGMode                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.GetSupportedDLSSGModes
// 0x0010 (0x0010 - 0x0000)
struct StreamlineLibraryDLSSG_GetSupportedDLSSGModes final
{
public:
	TArray<EUStreamlineDLSSGMode>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.IsDLSSGModeSupported
// 0x0002 (0x0002 - 0x0000)
struct StreamlineLibraryDLSSG_IsDLSSGModeSupported final
{
public:
	EUStreamlineDLSSGMode                         DLSSGMode;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.IsDLSSGSupported
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_IsDLSSGSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.QueryDLSSGSupport
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_QueryDLSSGSupport final
{
public:
	EUStreamlineDLSSGSupport                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.SetDLSSGMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_SetDLSSGMode final
{
public:
	EUStreamlineDLSSGMode                         DLSSGMode;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetDefaultReflexMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_GetDefaultReflexMode final
{
public:
	EUStreamlineReflexMode                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetGameLatencyInMs
// 0x0004 (0x0004 - 0x0000)
struct StreamlineLibraryReflex_GetGameLatencyInMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetGameToRenderLatencyInMs
// 0x0004 (0x0004 - 0x0000)
struct StreamlineLibraryReflex_GetGameToRenderLatencyInMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetReflexMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_GetReflexMode final
{
public:
	EUStreamlineReflexMode                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetRenderLatencyInMs
// 0x0004 (0x0004 - 0x0000)
struct StreamlineLibraryReflex_GetRenderLatencyInMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryReflex.IsReflexSupported
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_IsReflexSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryReflex.QueryReflexSupport
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_QueryReflexSupport final
{
public:
	EUStreamlineReflexSupport                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StreamlineBlueprint.StreamlineLibraryReflex.SetReflexMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_SetReflexMode final
{
public:
	EUStreamlineReflexMode                        Mode;                                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

