#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Discovery_MessageNoResults

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Discovery_MessageNoResults.WBP_Discovery_NoResultsMessage_C
// 0x0058 (0x0318 - 0x02C0)
class UWBP_Discovery_NoResultsMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_FlavorTitle;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   TextRich_FlavorMessage;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   FlavorMessageBase;                                 // 0x02D8(0x0018)(Edit, BlueprintVisible)
	class FText                                   FlavorTitleBase;                                   // 0x02F0(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           SubTextColor;                                      // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Discovery_NoResultsMessage(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Message_Text_Overrides(const class FText& InTitle, const class FText& InMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Discovery_NoResultsMessage_C">();
	}
	static class UWBP_Discovery_NoResultsMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Discovery_NoResultsMessage_C>();
	}
};

}

