#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPItemShop_Screen

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPItemShop_Screen.WBP_MPItemShop_Screen_C
// 0x0100 (0x08D0 - 0x07D0)
class UWBP_MPItemShop_Screen_C final : public UFortMPItemShopScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemShopVM*                        FortItemShopVM;                                    // 0x07D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_BackToGame;                                 // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_BackToNav;                                  // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_OpenQuickNavTouch;                          // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_SAC;                                        // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_ShopRefreshTimer;                           // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_ShowPreviewTouch;                           // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Content;                                   // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NoOffers;                                  // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_CameraFrame;                                // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_Main;                                     // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ShopRefresh_Spacer;                           // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MPItemShop_Content_C*              WBP_MPItemShop_Content;                            // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MPItemShop_SectionNavigator_C*     WBP_MPItemShop_SectionNavigator;                   // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           MarkAllOfferGroupsAsItemShopVisitedHandler;        // 0x0848(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MarkAllOfferGroupsAsItemShopVisitedDelay;          // 0x0850(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_854[0x4];                                      // 0x0854(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CameraFrameWidth;                                  // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmptyCameraFrameWidth;                             // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 FocusedOfferId;                                    // 0x0868(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsSoftActivation;                                  // 0x0878(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemShopLayout                    CachedFeaturedLayout;                              // 0x0880(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BackgroundTransitionTimerDelay;                    // 0x08A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A4[0x4];                                      // 0x08A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           PendingBackgroundTimer;                            // 0x08A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNavigatingToOffer;                               // 0x08B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B1[0x7];                                      // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             IntroWhooshSound;                                  // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NavRevealWhooshSound;                              // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NavHideWhooshSound;                                // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MPItemShop_Screen_Button_BackToGame_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_Button_BackToNav_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_Button_OpenQuickNavTouch_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_Button_SAC_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_Button_ShowPreviewTouch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_WBP_MPItemShop_Content_K2Node_ComponentBoundEvent_3_OnOfferFocused__DelegateSignature(const class FString& OfferId);
	void BndEvt__WBP_MPItemShop_Screen_WBP_UIKit_Button_Quiet_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CancelRequestMarkAllOfferGroupsAsItemShopVisited();
	void CheckForNoOffers(TArray<class UFortItemShopOfferGroupVM*>& AllOfferGroupsWithOffers);
	void CreateNavigationBindings();
	void ExecuteUbergraph_WBP_MPItemShop_Screen(int32 EntryPoint);
	class UWidget* FocusContent(EUINavigation Navigation_0);
	void FocusFirstOfferInCurrentRow();
	void FullActivate();
	void FullDeactivate();
	class UFortItemShopVM* GetItemShopVM();
	void Handle_Quicknav_or_Content_Focus(bool ShouldFocusSectionNavigator);
	void MarkAllOfferGroupsAsItemShopVisited();
	void OnBackgroundDataLoaded(class UObject* LoadedBackground);
	void OnContentFocused();
	void OnInputModeChanged(bool bUsingGamepad);
	void OnIsItemPreviewEnabledChanged(bool IsItemPreviewEnabled);
	void OnNavigateToOffer(const class FString& OfferTrackingId, bool bShowOfferDetails);
	void OnPendingBackgroundTImerExpired();
	void OnPrimaryContentPushed_15E905BD4F03B8E631E252814BBB9CD8(class UCommonActivatableWidget* ActivatableWidget);
	void OnPrimaryContentPushed_D0E6C9E14F43D87511DAD1A05514A3F8(class UCommonActivatableWidget* ActivatableWidget);
	void OnScrollInput(const float ScrollAmount);
	void OnSectionNavigatorFocused();
	void OnSectionNavigatorUnfocused();
	void OnSetFeaturedOfferId(const class FString& FeaturedOfferId);
	void OnUpdateBackground(const struct FFortItemShopLayout& InLayout);
	void PreviewOfferFromID(const class FString& Offer_ID);
	void RequestMarkAllOfferGroupsAsItemShopVisited();
	void SoftActivate();
	void SoftDeactivate();
	void Update_Preview_Quick_Nav_Buttons_Visibility();
	void UpdateCameraButtonVisibility();
	void UpdateHasSeenItemShop();
	void UpdateInGameButtons();
	void UpdateItemPreview();

	class UWidget* BP_GetDesiredFocusTarget() const;
	void GetShopRefreshTimerText(const struct FTimespan& ShopRefreshTimespan, class FText* TimerText) const;
	void GetSupportCreatorText(const class FString& AffiliateName, class FText* TimerText) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPItemShop_Screen_C">();
	}
	static class UWBP_MPItemShop_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPItemShop_Screen_C>();
	}
};

}

