#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPItemShop_Tile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "WBP_ItemShopTile_Base_classes.hpp"
#include "E_PriceSwitcherState_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPItemShop_Tile.WBP_MPItemShop_Tile_C
// 0x00C0 (0x1910 - 0x1850)
class UWBP_MPItemShop_Tile_C final : public UWBP_ItemShopTile_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_MPItemShop_Tile_C;              // 0x1848(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemShopVM*                        FortItemShopVM;                                    // 0x1850(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortItemShopOfferVM*                   FortItemShopOfferVM;                               // 0x1858(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAthenaItemShopOfferInfo*               OfferInfo;                                         // 0x1860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   SubscriptionDefaultStatusText;                     // 0x1868(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SubscriptionActiveStatusText;                      // 0x1880(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SubscriptionPaymentErrorStatusText;                // 0x1898(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumItemsInOffer;                                   // 0x18B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewedItemIndex;                                // 0x18B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   SubscriptionShortDescriptionText;                  // 0x18B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CrewBlingShortDescriptionText;                     // 0x18D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DelayBetweenItemPreviews;                          // 0x18E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18EC[0x4];                                     // 0x18EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ItemPreviewTimerHandle;                            // 0x18F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CosmeticItemsInOffer;                              // 0x18F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ClearItemPreviewTimer();
	void ClearTimers();
	void ExecuteUbergraph_WBP_MPItemShop_Tile(int32 EntryPoint);
	void GetLegacyImage(TSoftObjectPtr<class UObject>* SoftTileImage);
	void HandleItemPreview(bool IsAnExternalCall);
	void HandleNoLoadedPresentations();
	void InitializeTile();
	void OnLoaded_6E8BFC144A23420D321B38A879F2F060(class UObject* Loaded);
	void OnLoaded_E927094B409D8F6B84D202A57ECED594(class UObject* Loaded);
	void OnPresentationsLoaded(const TArray<class UObject*>& LoadedPresentations);
	void OnSetFallbackImage();
	void ParsePresentations(TArray<class UObject*>& Array, TArray<class UMaterialInterface*>* ParsedMaterials, TArray<class UTexture2D*>* ParsedTextures, bool* FoundMaterials);
	void RequestItemPreviewAtIndex(int32 ItemIndex);
	void SetActiveState(bool IsActiveState);
	void SetCosmeticItemsInOffer(TArray<struct FItemQuantity>& GrantedItems);
	void SetFortItemShopOfferVM(class UFortItemShopOfferVM* ViewModel);
	void SetFortItemShopVM(class UFortItemShopVM* ViewModel);
	void SetNextItemPreview();
	void SetTexturePresentation(class UTexture2D* InTexture);
	void UpdateImages(const class FString& DAV2Path);

	void __0211e952_42e6_1bf3_7904_98843e7293cf_SourceToDest(class FText* SalePrice) const;
	void __4c90696d_44b8_c534_b968_38aaec18190f_SourceToDest(class FText* DescriptionText) const;
	void __52a1faae_4388_519a_897a_46a79467320d_SourceToDest(ESlateVisibility* Visibility_0) const;
	void __5adb982d_4a07_0a49_8198_e48131129b9f_SourceToDest(class FText* SalePrice) const;
	void __d6ea8ba7_4a61_c005_b1f1_08b50e8d8c24_SourceToDest(E_PriceSwitcherState* PriceSwitcherState) const;
	void __fa14eeec_4a36_14fc_ccb8_7ebb4f3a01d5_SourceToDest(ESlateVisibility* StrikethroughPriceVisibility) const;
	void Get_Offer_Description_Text(bool IsSubscription, bool IsCrewBling, const class FText& ShortDescription, class FText* DescriptionText) const;
	void GetColorsFromGrantedItems(TArray<struct FItemQuantity>& GrantedItems, struct FFortColorPalette* ColorPalette) const;
	void GetOfferDescriptionVisibility(const class FText& ShortDescription, bool IsSubscription, bool IsCrewBling, bool IsLevelBundle, EItemShopCurrency Currency_0, ESlateVisibility* Visibility_0) const;
	void GetPriceFormattedText(bool IsSalePrice, int32 BoundProperty, class FText* SalePrice) const;
	void GetPriceInfoState(bool IsOwned, bool IsSubscription, bool IsCrewBling, E_PriceSwitcherState* PriceSwitcherState) const;
	void GetSubInfoText(bool bIsSubscription, class FText* SubInfoText) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPItemShop_Tile_C">();
	}
	static class UWBP_MPItemShop_Tile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPItemShop_Tile_C>();
	}
};

}

