#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Discovery_BlankTiles_RoundedCorners

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Discovery_BlankTiles_RoundedCorners.WBP_Discovery_BlankTiles_RoundedCorners_C
// 0x0048 (0x0308 - 0x02C0)
class UWBP_Discovery_BlankTiles_RoundedCorners_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTileView*                              TileView_BlankTiles;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discovery_MessageNoResults_NewFont_C* WBP_Discovery_MessageNoResults_NewFont;         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   FlavorTitleOverride;                               // 0x02D8(0x0018)(Edit, BlueprintVisible)
	struct FVector2D                              EntrySize;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Entries_Count;                                     // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Discovery_BlankTiles_RoundedCorners(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetEntryTileSize();
	void SetMessageTextOverrides(const class FText& InTitle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Discovery_BlankTiles_RoundedCorners_C">();
	}
	static class UWBP_Discovery_BlankTiles_RoundedCorners_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Discovery_BlankTiles_RoundedCorners_C>();
	}
};

}

