#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_Tab_Collapsible

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_UI_Alignment_structs.hpp"
#include "WBP_UIKit_Button_Selectable_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C
// 0x00B0 (0x17B0 - 0x1700)
class UWBP_UIKit_Button_Tab_Collapsible_C final : public UWBP_UIKit_Button_Selectable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_Tab_Collapsible_C; // 0x1700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnSelected;                                        // 0x1708(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnCollapsed;                                       // 0x1710(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Pip;                                         // 0x1718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Pip;                                       // 0x1720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_MinHeight;                                  // 0x1728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                TopAlignmentPadding;                               // 0x1730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                BottomAlignmentPadding;                            // 0x1740(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                LeftAlignmentPadding;                              // 0x1750(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                RightAlignmentPadding;                             // 0x1760(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_UI_Alignment                                SelectedBarPosition;                               // 0x1770(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1771[0x3];                                     // 0x1771(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PipHeightSelected;                                 // 0x1774(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PipHeightUnselected;                               // 0x1778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrapTextAt;                                        // 0x177C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SelectedAnimValue;                                 // 0x1780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        CollapsedAnimValue;                                // 0x1788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        SelectedAnimationProgress;                         // 0x1790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TextMaxHeight;                                     // 0x1798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TextOnOneLine;                                     // 0x17A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void Event_On_Collapsed();
	void Event_On_Expanded();
	void ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible(int32 EntryPoint);
	void InitializeLayout();
	void InitializeText();
	void PreConstruct(bool IsDesignTime);
	void ResetAnimations();
	void SetCollapsedAnimValue(double CollapsedAnimationProgress);
	void SetSelectedAnimValue(double AnimValue);
	void SetSelectionAlignment(E_UI_Alignment Selection_Alignment);
	void SetTextOnOneLine(double Value);
	void UpdateAlignment(E_UI_Alignment Selection_Alignment);
	void UpdatePadding(E_UI_Alignment SelectionAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_Tab_Collapsible_C">();
	}
	static class UWBP_UIKit_Button_Tab_Collapsible_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_Tab_Collapsible_C>();
	}
};

}

