#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IslandTile_Full

#include "Basic.hpp"

#include "WBP_IslandTile_Minimal_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IslandTile_Full.WBP_IslandTile_Full_C
// 0x0040 (0x16F0 - 0x16B0)
class UWBP_IslandTile_Full_C final : public UWBP_IslandTile_Minimal_C
{
public:
	class UWidgetAnimation*                       Anim_OnFullHoverSelect;                            // 0x16B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               OriginalContentEpicBanner;                         // 0x16B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USqueegeeInjectionSlot_C*               SqueegeeSlot_Tag;                                  // 0x16C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_IslandName;                                   // 0x16C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActivityBrowserSocialProof_NEW_C*  WBP_ActivityBrowserSocialProof_NEW;                // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Island_State_Favorite_C*           WBP_Island_State_Favorite;                         // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LockedStatus_C*                    WBP_LockedStatus;                                  // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnTileSelectionActive();
	void OnTileSelectionNotActive();
	void SetByEpicBanner(bool IsByEpic);
	void SetCCUCount(int32 CCUCount);
	void SetIsFavorite(bool IsFavorited);
	void SetIslandName(const class FText& IslandName);
	void SetPurchaseRequired(bool IsPurchaseRequired);
	void SetupSqueegeeWidgets(class UFortActivityViewModel* ActivityVM);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IslandTile_Full_C">();
	}
	static class UWBP_IslandTile_Full_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IslandTile_Full_C>();
	}
};

}

