#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPItemShop_Row

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPItemShop_Row.WBP_MPItemShop_Row_C
// 0x0080 (0x0368 - 0x02E8)
class UWBP_MPItemShop_Row_C final : public UFortMPItemShopRow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemShopOfferGroupVM*              FortItemShopOfferGroupVM;                          // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UButton*                                Button_RowHitbox;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MPItemShop_RowFillerButton_C*      RowFillerButton;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_RowContent;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_SubsectionBottomPadding;                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SectionTitle;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SubsectionTitle;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              TileDimensions;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemShopVM*                        FortItemShopVM;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsRowActive;                                       // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRowPeeked;                                       // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UUserWidget* RowWidget)> OnRowFocused;                       // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ParentHasFocus;                                    // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MarkOfferGroupAsVisitedDelay;                      // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MarkOfferGroupAsVisitedHandler;                    // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MPItemShop_Row_Button_RowHitbox_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MPItemShop_Row_Button_RowHitbox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MPItemShop_Row_Button_RowHitbox_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_MPItemShop_Row_WBP_FillerButton_K2Node_ComponentBoundEvent_3_FillerButtonFocused__DelegateSignature();
	void CancelRequestMarkOfferGroupAsVisited();
	void ExecuteUbergraph_WBP_MPItemShop_Row(int32 EntryPoint);
	void GetDesiredFocusTile(class UUserWidget** TileWidget);
	void GetFirstTile(class UUserWidget** TileWidget);
	void GetLastTileWidget(class UUserWidget** LastTileWidget);
	void GetTileAtIndex(int32 Index_0, class UUserWidget** TileWidget);
	void GetTileByOfferId(const class FString& OfferId, class UUserWidget** TileWidget);
	void InitializeHeaders();
	void InitializeSubheader(class UFortItemShopSectionVM* SectionVM);
	bool IsLastRowInSection(class UFortItemShopSectionVM* SectionVM);
	void MarkOfferGroupAsVisited();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnUpdateOffers(TArray<class UFortItemShopOfferVM*>& OffersVM);
	void RequestMarkOfferGroupAsVisited();
	void SetFortItemShopOfferGroupVM(class UFortItemShopOfferGroupVM* ViewModel);
	void SetHeaderText(const class FText& Text);
	void SetParentHasFocusState(bool HasFocus);
	void SetRowActiveState(bool IsActiveState);
	void SetRowHitboxVisibility();
	void SetRowPeekState(bool IsInPeekState);
	void SetRowWidth(double Width);
	void SetSubheaderText(const class FText& Text);
	void SetTileNavigation();
	bool ShouldShowHeader(class UFortItemShopSectionVM* SectionVM);
	void ShowSectionHeader(bool ShouldShowHeader_0);
	void ShowSubsectionEndSpacer(bool Show);
	void ShowSubsectionHeader(bool ShouldShowHeader_0);
	void UpdateTileSizes(TArray<class UFortItemShopOfferVM*>& Offers);

	class FText __1c01b1a9_45ab_9040_3eb9_9dab19ca9413_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPItemShop_Row_C">();
	}
	static class UWBP_MPItemShop_Row_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPItemShop_Row_C>();
	}
};

}

