#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatsOptionsModal

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatsOptionsModal.WBP_StatsOptionsModal_C
// 0x0078 (0x0478 - 0x0400)
class UWBP_StatsOptionsModal_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortniteDefaultBackgroundBlurWidget_C* FortniteDefaultBackgroundBlurWidget;               // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_40;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatsOptionsModalSection_C*        WBP_StatsOptionsModalSection_Mode;                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatsOptionsModalSection_C*        WBP_StatsOptionsModalSection_Ranked;               // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatsOptionsModalSection_C*        WBP_StatsOptionsModalSection_Season;               // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatsOptionsModalSection_C*        WBP_StatsOptionsModalSection_SubMode;              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              WBP_UIKit_Button_Quiet_1;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ApplyOptions;                                      // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FString>                         SeasonNames;                                       // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_StatsOptionsModalSection_C*> Sections;                                         // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__WBP_StatsOptionsModal_WBP_UIKit_Button_Quiet_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_StatsOptionsModal_WBP_UIKit_Button_Quiet_1_K2Node_ComponentBoundEvent_1_OnFocusChanged__DelegateSignature(bool HasFocus);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_StatsOptionsModal(int32 EntryPoint);
	void GetAllDisplayTextsForSelected(class FText* GameMode, class FText* Ranked, class FText* SubMode, class FText* SeasonName);
	void GetAllSelected(class FString* GameMode, class FString* Ranked, class FString* SubMode, class FString* SeasonName);
	void HandleNavigationFromSectionToSection(int32 FromSectionIndex, int32 ToSectionIndex);
	void InitializeSections();
	void PopulateSeasons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatsOptionsModal_C">();
	}
	static class UWBP_StatsOptionsModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatsOptionsModal_C>();
	}
};

}

