#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IslandTile_Minimal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IslandTile_Minimal.WBP_IslandTile_Minimal_C
// 0x00B0 (0x16B0 - 0x1600)
class UWBP_IslandTile_Minimal_C : public UFortActivityTileDetailsDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortActivityViewModel*                 FortActivityViewModel;                             // 0x1608(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnHoverUnhoverRehover;                        // 0x1610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnHoverSelect;                                // 0x1618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnLoadedImage;                                // 0x1620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               ErrorIcon_Container;                               // 0x1628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GridImageAndIcons;                                 // 0x1630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             MainSlot;                                          // 0x1638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_main;                                      // 0x1640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Banner;                                       // 0x1648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_OutsideContent;                               // 0x1650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Top;                                          // 0x1658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USqueegeeInjectionSlot_C*               SqueegeeSlot_Lock;                                 // 0x1660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TileThumbnail;                                     // 0x1668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             VideoSlot;                                         // 0x1670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortVisualAttachment*                  VisualAttachment_OutsideContent;                   // 0x1678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tile_CornerInfo_C*                 WBP_Tile_CornerInfo;                               // 0x1680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Outline_C*            WBP_UIKit_Button_Outline;                          // 0x1688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              TileSize;                                          // 0x1690(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TextureParam;                                      // 0x16A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOldDiscoverCode;                                 // 0x16A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A5[0x3];                                     // 0x16A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThumbnailDisabledOverlay;                          // 0x16A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFullTile;                                        // 0x16AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableCornerInfo;                                 // 0x16AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnFocusLost();
	void BP_OnFocusReceived();
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnReleased();
	void BP_OnUnhovered();
	void ColumnSizeToTileSize(int32 NewColumnSize, struct FVector2D* NewTileSize);
	void ExecuteUbergraph_WBP_IslandTile_Minimal(int32 EntryPoint);
	void OnColumnSizeUpdated(int32 NewColumnSize);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnRespondToTileViewVisibilityChange(bool bIsVisible);
	void OnSetInvalidActivityReason(EFortInvalidActivityReason InvalidActivityReason);
	void OnTileActiveSet(const bool bIsTileActive);
	void OnTileSelectionActive();
	void OnTileSelectionNotActive();
	void OnUpdateColumnSize(int32 NewColumnSize);
	void OnVMByEpicUpdated(bool IsByEpic);
	void OnVMConcurrentUsersUpdated(int32 CCUCount);
	void OnVMFavoriteUpdated(bool IsFavorited);
	void OnVMIsContentGatedUpdated(bool IsContentGated);
	void OnVMIslandNameUpdated(const class FText& IslandName);
	void OnVMPurchaseRequiredUpdated(bool IsPurchaseRequired);
	void PreConstruct(bool IsDesignTime);
	void Set_Image_Spinner_State(EActivityImageLoadingState InImageState);
	void Set_Image_State(EActivityImageLoadingState LoadingEnum);
	void Set_Image_Success_State();
	void Set_Tile_Size(const struct FVector2D& InSize);
	void SetByEpicBanner(bool IsByEpic);
	void SetCCUCount(int32 CCUCount);
	void SetCornerRadius(const struct FLinearColor& CornerRadius);
	void SetDisabledThumbnailOverlay();
	void SetFortActivityViewModel(class UFortActivityViewModel* ViewModel);
	void SetFriendsPlayingCount(int32 FriendsPlayingCount);
	void SetImageErrorState(EActivityImageLoadingState ImageLoadState);
	void SetIsCurrentActivity(bool IsCurrentActivity);
	void SetIsFavorite(bool IsFavorited);
	void SetIslandName(const class FText& IslandName);
	void SetIsTileEnabled();
	void SetPurchaseRequired(bool IsPurchaseRequired);
	void SetupSqueegeeWidgets(class UFortActivityViewModel* ActivityVM);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IslandTile_Minimal_C">();
	}
	static class UWBP_IslandTile_Minimal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IslandTile_Minimal_C>();
	}
};

}

